{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and read-only phone/crypto report queries using Map structures.",
  "feature_evidence.json": "JSON document listing feature evidence entries with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten collection of short summaries describing various frontend files and their roles.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and light/dark theme variables for the UI.",
  "frontend/index.html": "Main HTML entry point linking icons, manifest, metadata, and mounting the React app.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming that Phase 3a introduces a read‑only canister requiring no frontend changes.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Checklist covering routes, consent gate, branding, analysis flows, database lookups, and multilingual behavior for production readiness.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell while showing basic branding.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining AntiFraud’s name, start URL, colors, orientation, and icon set.",
  "frontend/public/service-worker.js": "Implements PWA caching with install, activate, and fetch handlers using a versioned cache and network-first strategy.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Step‑by‑step guide for verifying WebAPK installation behavior on Android Chrome.",
  "frontend/src/App.tsx": "Main app component configuring routing, consent gate, PWA install flow, service worker registration, and layout providers.",
  "frontend/src/backend.idl.ts": "Defines an IDL service exposing a single analyzeText function that takes and returns text.",
  "frontend/src/components/AppLayout.tsx": "Provides the main layout with header, navigation, language/auth controls, and mobile menu handling.",
  "frontend/src/components/AuthControl.tsx": "Renders login button or authenticated user menu based on Internet Identity state.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, and status alerts.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring acceptance of cookies and terms before app usage, with navigation to terms/privacy.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder file for dashboard quick actions.",
  "frontend/src/components/InstallButton.tsx": "Button that triggers PWA installation and shows an alert if not eligible.",
  "frontend/src/components/LanguageSelector.tsx": "Language picker dropdown allowing users to switch between supported translations.",
  "frontend/src/components/PwaInstallAction.tsx": "Small PWA install action button that invokes the triggerPWAInstall helper.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog component that validates and submits fraud reports with rate limiting and form state handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud analysis results including risk, explanation, recommendation, sources, and metadata.",
  "frontend/src/components/UserProfileMenu.tsx": "Renders user info, browsing history, and logout controls using Internet Identity and stored profile data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and tracks multiple anti-fraud canister actors and logs a one-time readiness report.",
  "frontend/src/hooks/useConsentGate.ts": "Handles user consent persistence and determines whether consent is required based on versioned local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and identity loading via a React context.",
  "frontend/src/hooks/usePwaInstall.ts": "Placeholder hook file with no implementation.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Placeholder hook file with no implementation.",
  "frontend/src/hooks/useUserProfile.ts": "Manages user-specific history storage keyed by principal with load, add, and clear operations.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a React context for language selection and translations, persisting the chosen language in sessionStorage.",
  "frontend/src/i18n/translations.ts": "Defines the Portuguese translation dictionary used throughout the app.",
  "frontend/src/ic/actors.ts": "Creates DFINITY canister actors for main, extra, and reports canisters using a shared HTTP agent.",
  "frontend/src/ic/canisterIds.ts": "Stores static canister IDs and exposes a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines the IDL and TypeScript interface for extra canister methods related to phone and crypto report lookups.",
  "frontend/src/ic/idl/main.idl.ts": "Defines the IDL and interface for the main canister’s text analysis method.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines the IDL and interfaces for submitting reports and querying risk data from the reports canister.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report indicating availability and method presence for each canister actor.",
  "frontend/src/index.css": "Configures Tailwind base styles, color variables, dark mode, and accessibility-focused global styles.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the app.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders the documentation page with translation text, SEO setup, and a button to generate the PDF documentation.",
  "frontend/src/pages/HomePage.tsx": "Main landing page providing tabs to analyze messages, emails, phone numbers, and crypto addresses with error handling and result rendering.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains verification methods using accordion sections and sets SEO metadata with defensive rendering of translated content.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty page placeholder with no implementation.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty page placeholder with no implementation.",
  "frontend/src/pages/MissionPage.tsx": "Displays mission‑related sections with icons and translated paragraphs, also setting SEO metadata.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders privacy policy sections using translated text and sets SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Renders terms and conditions sections using translated text and sets SEO metadata.",
  "frontend/src/pwa/install.ts": "Implements deferred PWA installation prompt handling and a trigger function to initiate installation.",
  "frontend/src/router/useSimpleRouter.ts": "Lightweight custom router that tracks path changes via events and provides navigate and currentRoute state.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Utility functions for normalizing text and detecting keywords using accent-insensitive matching.",
  "frontend/src/utils/documentationContent.ts": "Builds a Portuguese documentation structure using translation keys and static sections for branding, institutional pages, terms, and privacy policy.",
  "frontend/src/utils/emailHeuristics.ts": "Provides deterministic frontend email risk scoring by checking domains, TLDs, typosquatting patterns, randomness, and formatting.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates a downloadable text file version of the documentation by assembling sections into a structured text output.",
  "frontend/src/utils/localRateLimit.ts": "Implements a localStorage‑based cooldown to rate‑limit user submissions and report remaining time.",
  "frontend/src/utils/messageHeuristics.ts": "Analyzes messages for scam indicators using keyword weights, crypto patterns, URLs, punctuation, and capitalization to assign a risk score.",
  "frontend/src/utils/seo.ts": "Sets page title and meta description dynamically with AntiFraud branding for SPA routes.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Defines a structured heuristic fraud‑analysis engine with localization templates and indicator labeling for multiple risk levels.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary‑based translation of backend analysis text from Portuguese into other languages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus utilities to clear stored params.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profiles in localStorage, storing history entries and preferences keyed by principal.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining themes, colors, typography, animations, and plugin usage.",
  "project_state.json": "Project metadata describing current build state, architecture notes, known issues, and existing features for the AntiFraud app."
}