{
  "backend/main.mo": "Motoko canister defining user profiles with access control, plus read-only phone and crypto report lookups.",
  "feature_evidence.json": "Feature evidence report mapping features to their files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, components, and configurations.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, light/dark themes, and global layout variables.",
  "frontend/index.html": "HTML entry point configuring metadata, icons, manifest, and loading the main React bundle.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming Phase 3a adds a read‑only canister requiring no frontend code changes.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Deployment checklist covering routing, consent gate, branding, antifraud analysis, multilingual content, and lookup verification.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell.",
  "frontend/public/data/public-contact-lookup.json": "Static dataset providing public contact lookup entries with source info and timestamps.",
  "frontend/public/manifest.webmanifest": "Defines the PWA manifest for AntiFraud, including metadata, colors, start URL, and icons.",
  "frontend/public/service-worker.js": "Implements a service worker with precaching, cache cleanup, and a network-first fetch strategy.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Step‑by‑step checklist for validating Android Chrome WebAPK installation behavior.",
  "frontend/src/App.tsx": "Main React app that sets up providers, routing, consent gating, and service worker registration.",
  "frontend/src/backend.idl.ts": "Defines the backend canister interface with a single analyzeText function.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component that validates phone/email input, performs antifraud analysis, fetches public info, and caches results with offline support.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "Displays antifraud analysis and public contact info with risk indicators and offline/cache notices.",
  "frontend/src/components/AppLayout.tsx": "Provides global page layout with navigation, header, mobile menu, language selector, and auth controls.",
  "frontend/src/components/AuthControl.tsx": "Handles Internet Identity login/logout and displays user profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Shows community-based risk score, categories, and details for collaborative lookup results with error handling.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring users to accept cookies and terms before proceeding, with navigation to terms/privacy and enforced confirmation checks.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/InstallButton.tsx": "Button triggering PWA installation and showing an alert if installation is not eligible.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown allowing users to switch application languages using the i18n provider.",
  "frontend/src/components/PwaInstallAction.tsx": "Small button triggering PWA installation without eligibility messaging.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting fraud reports with validation, rate limiting, and success/error handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Card displaying structured fraud analysis details including risk, explanation, recommendations, and source links.",
  "frontend/src/components/UserProfileMenu.tsx": "User profile panel showing identity info, search history management, and logout option.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to user identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Hook managing localStorage-backed cache for phone/email lookup results with add, get, and clear functions.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and stores main, extra, and reports canister actors using the current identity and logs a readiness report once.",
  "frontend/src/hooks/useConsentGate.ts": "Manages a localStorage-backed consent flag requiring users to accept terms before proceeding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks the browser’s online/offline status via window events.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder hook.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useUserProfile.ts": "Loads, saves, and clears per-identity user history from local storage and exposes history manipulation helpers.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, persistence, and translation access through context.",
  "frontend/src/i18n/translations.ts": "Defines the full Portuguese translation dictionary for the app UI.",
  "frontend/src/ic/actors.ts": "Creates HTTP agents and typed actor instances for main, extra, and reports canisters on IC mainnet.",
  "frontend/src/ic/canisterIds.ts": "Defines and exports static canister IDs and a helper to retrieve them.",
  "frontend/src/ic/idl/extra.idl.ts": "Candid interface for the extra canister exposing phone and crypto report queries.",
  "frontend/src/ic/idl/main.idl.ts": "Candid interface for the main canister providing text analysis.",
  "frontend/src/ic/idl/reports.idl.ts": "Candid interface for the reports canister including submitting and querying fraud reports.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report showing canister IDs and whether each actor and method is available.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables with accessibility and mobile tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders a documentation page with translated sections and triggers PDF generation.",
  "frontend/src/pages/HomePage.tsx": "Implements the main verification UI with tabs for analyzing messages, email, phone, and crypto data.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays expandable sections explaining how each verification method works using localized text.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/MissionPage.tsx": "Shows mission-related sections like vision, core mission, impact, and values with i18n and SEO setup.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the Privacy Policy page with SEO metadata and multiple text sections using translations. Includes a helper to safely render translation paragraphs with fallbacks.",
  "frontend/src/pages/TermsPage.tsx": "Displays the Terms and Conditions page with SEO setup and sectioned content sourced from translations. Uses a defensive paragraph renderer similar to the Privacy page.",
  "frontend/src/pwa/install.ts": "Implements PWA installation handling by capturing the beforeinstallprompt event and exposing a function to trigger the deferred install prompt. Tracks and resets install state to prevent duplicate prompts.",
  "frontend/src/router/useSimpleRouter.ts": "Provides a lightweight custom router using shared module state, browser history, and a custom navigation event. Exposes currentRoute and a navigate function to update the path.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Offers text normalization for accent- and case-insensitive matching plus utilities to detect and extract keywords in normalized text. Used for antifraud keyword heuristics.",
  "frontend/src/utils/contactInputHeuristics.ts": "Implements contact-type detection, normalization, and validation for phone and email inputs with multilingual error messages. Provides heuristics to classify and sanitize user-entered contact data.",
  "frontend/src/utils/documentationContent.ts": "Builds a structured documentation object by combining fixed content with Portuguese translation fields. Aggregates institutional, mission, terms, and privacy sections into a unified documentation format.",
  "frontend/src/utils/emailHeuristics.ts": "Runs deterministic checks on emails to flag suspicious domains, TLDs, typosquatting, and random patterns. Returns a simple safe/flagged result with the reason.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Builds AntiFraud documentation text content and triggers a client-side download as a .txt file.",
  "frontend/src/utils/localRateLimit.ts": "Implements local cooldown tracking in localStorage to rate-limit submissions for one minute.",
  "frontend/src/utils/messageHeuristics.ts": "Performs lightweight client-side scam detection by scoring keywords, URLs, crypto patterns, and formatting anomalies.",
  "frontend/src/utils/publicContactLookup.ts": "Loads a local JSON dataset and returns public metadata matches for phone or email contacts.",
  "frontend/src/utils/seo.ts": "Sets page title and meta description dynamically for SPA routes with AntiFraud branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Provides deterministic, language-specific fraud risk evaluation with structured explanations and recommendations.",
  "frontend/src/utils/translateBackendResult.ts": "Translates common Portuguese scam-analysis terms into other languages using a dictionary-based replacer.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, persists, and clears URL parameters, supporting both query and hash routing.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profiles in localStorage, including analysis history and language preferences.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, extended OKLCH color system, typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Project state metadata detailing current release, architecture notes, known issues, and existing feature records for the AntiFraud app."
}