{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus read-only phone and crypto report getters.",
  "feature_evidence.json": "Feature evidence list mapping requested PWA test modifications to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend files and their roles in the application.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Main HTML entry including manifest, icons, meta tags, and root app mount.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Docs confirming Phase 3a adds a read‑only canister and requires no frontend changes.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell.",
  "frontend/public/manifest.webmanifest": "Minimal PWA manifest for WebAPK testing with required fields and 192/512 icons.",
  "frontend/public/service-worker.js": "Test service worker implementing install/activate caching and network-first fetch fallback.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Checklist for testing WebAPK installation behavior in Chrome on Android.",
  "frontend/src/App.tsx": "Sets up app providers, routing, consent gate, and PWA initialization, rendering pages based on normalized routes.",
  "frontend/src/backend.idl.ts": "Defines a simple canister interface with an analyzeText function.",
  "frontend/src/components/AppLayout.tsx": "Provides the main layout with header navigation, mobile menu, language selector, and auth controls.",
  "frontend/src/components/AuthControl.tsx": "Handles Internet Identity login and displays profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, and error/empty states.",
  "frontend/src/components/ConsentGateModal.tsx": "Shows a mandatory consent modal requiring acceptance of cookies and terms before using the app.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/InstallButton.tsx": "Triggers PWA installation and alerts if installation is not available.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown for selecting the app language from predefined options.",
  "frontend/src/components/PwaInstallAction.tsx": "Small button component that triggers PWA installation using localized text.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Form dialog for submitting reports with validation, rate limiting, and success handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Component rendering structured fraud analysis results with risk badges, icons, explanation, and recommendation using i18n.",
  "frontend/src/components/UserProfileMenu.tsx": "User profile menu showing principal, history list, and logout, with identity and profile hooks.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Hook initializing main, extra, and reports anti-fraud actors and logging readiness once per load.",
  "frontend/src/hooks/useConsentGate.ts": "Hook managing localStorage‑based consent state with versioning and accept action.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth client, login flow, and identity persistence.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder file.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder file.",
  "frontend/src/hooks/useUserProfile.ts": "Hook managing per‑identity user history stored in localStorage with add and clear operations.",
  "frontend/src/i18n/I18nProvider.tsx": "i18n context provider storing selected language in sessionStorage and exposing translations.",
  "frontend/src/i18n/translations.ts": "Portuguese translation dictionary containing UI labels, navigation, consent text, and app messages.",
  "frontend/src/ic/actors.ts": "Creates HttpAgent instances and provides factory functions for main, extra, and reports canister actors.",
  "frontend/src/ic/canisterIds.ts": "Defines static canister IDs and a helper to fetch them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Candid IDL and TypeScript interface for extra canister phone and crypto report lookup queries.",
  "frontend/src/ic/idl/main.idl.ts": "Candid IDL and interface for the main canister’s text analysis update method.",
  "frontend/src/ic/idl/reports.idl.ts": "Candid IDL and interfaces for submitting reports and querying risk data across multiple report types.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report showing available canisters and supported methods.",
  "frontend/src/index.css": "Tailwind base setup with light/dark theme variables and accessibility-focused global styles.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/DocumentationPage.tsx": "Documentation UI page with SEO setup and a button to generate a documentation PDF.",
  "frontend/src/pages/HomePage.tsx": "Home page providing message, email, phone, and crypto fraud analysis via tabbed inputs and result display.",
  "frontend/src/pages/HowItWorksPage.tsx": "Renders a multilingual 'How It Works' page with accordion-based sections and SEO metadata setup.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty file placeholder for an institutional mission page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty file placeholder for a general institutional page.",
  "frontend/src/pages/MissionPage.tsx": "Displays the mission, vision, values, and limitations content using translation data and SEO metadata.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the privacy policy page with multiple sections sourced from translations and sets SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Shows the terms and conditions page with structured sections populated from translations and SEO setup.",
  "frontend/src/pwa/install.ts": "Implements PWA installation handling by capturing install prompts and exposing a trigger function.",
  "frontend/src/router/useSimpleRouter.ts": "Provides a minimal custom router using browser history, custom events, and shared state.",
  "frontend/src/utils/documentationContent.ts": "Builds a full documentation structure combining static text with translation-driven institutional content.",
  "frontend/src/utils/emailHeuristics.ts": "Applies heuristic checks to classify emails as safe or flagged based on domains, TLDs, patterns, and character usage.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Builds technical documentation text content and triggers a downloadable TXT file using data from documentationContent.",
  "frontend/src/utils/localRateLimit.ts": "Implements a local cooldown timer using localStorage to limit report submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Scores messages for scam risk using keyword weights, crypto patterns, URLs, punctuation, and caps usage.",
  "frontend/src/utils/seo.ts": "Sets page title and meta description dynamically with AntiFraud branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Generates structured fraud‑risk evaluations using localized templates and heuristic indicators.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary‑based term replacement to translate backend analysis text into multiple languages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and persisting URL parameters across navigation.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profiles in localStorage, storing history and preferences keyed by principal.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project state describing scope, architecture notes, issues, and features for rebuilding a multilingual PWA/mobile antifraud app."
}