{
  "backend/main.mo": "Defines core backend types and maps for reports, contact lookup, provider config, user profiles, and access control, plus user profile getters/setters with permission checks.",
  "feature_evidence.json": "Lists implemented features with associated files, components, tests, and confidence levels for internationalization, language selector, and footer updates.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of numerous frontend files describing their purpose, features, and integration details.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color tokens, dark mode values, and global styling variables.",
  "frontend/index.html": "Main HTML entry loading the React app and PWA metadata.",
  "frontend/LIVE_INTEGRATION_RESTART_RUNBOOK.md": "Runbook outlining steps to restart and verify a clean production integration workflow after an interruption.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming no frontend changes are required for the Phase 3a read‑only database canister.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Comprehensive checklist for verifying production builds, covering routing, consent gate, branding, analysis behavior, and PWA requirements.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes to the app shell.",
  "frontend/public/data/public-contact-lookup.json": "Static lookup table with public phone and email metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, theme, metadata, and app behavior.",
  "frontend/public/service-worker.js": "Service worker implementing precaching and network-first caching for offline support.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Step‑by‑step guide for testing WebAPK installation behavior on Android Chrome.",
  "frontend/scripts/live-integration-complete.mjs": "Wrapper that runs the restart script and outputs a single success message when integration completes.",
  "frontend/scripts/restart-live-integration.mjs": "Build workflow script handling cleanup, dependency checks, builds, and success output for live integration.",
  "frontend/src/App.tsx": "Main React app with routing, layout, PWA setup, consent gate, and page rendering.",
  "frontend/src/backend.idl.ts": "IDL definition exposing the analyzeText backend service function.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component performing contact-type detection, public info lookup, antifraud analysis, caching, and backend queries.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "UI card showing risk analysis, scores, public info, offline indicators, and report submission options.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation, mobile menu, and footer, integrated with routing and i18n.",
  "frontend/src/components/AuthControl.tsx": "Authentication control showing login or profile menu based on Internet Identity state.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, and errors or empty states.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring acceptance of cookies and terms before proceeding, with navigation to legal pages.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer showing branding, ICP reference, data sources, and cybersecurity links using i18n labels.",
  "frontend/src/components/InstallButton.tsx": "Button triggering PWA install flow and alerting if installation is not eligible.",
  "frontend/src/components/InternationalContactSearchResult.tsx": "Renders detailed international contact risk information including scores, country, and trust data.",
  "frontend/src/components/LanguageSelector.tsx": "Language selection dropdown allowing users to switch app language via i18n provider.",
  "frontend/src/components/PwaInstallAction.tsx": "Small button to initiate PWA installation using shared install helper.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting lookup reports with category selection, optional description, anonymity notice, and success/error handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud analysis results including risk level, explanation, recommendation, sources, and collaborative basis.",
  "frontend/src/components/UserProfileMenu.tsx": "Shows authenticated user info, lookup history with clearing support, and a logout button.",
  "frontend/src/config/features.ts": "Defines feature-flag configuration and helpers for toggling PRO, external provider, and advanced scoring features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Manages localStorage-backed cache for advanced contact lookup results with add, get, and clear utilities.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes main, extra, and reports canister actors tied to identity and logs a readiness report once.",
  "frontend/src/hooks/useConsentGate.ts": "Handles persisted user-consent state with versioning and provides accept functionality.",
  "frontend/src/hooks/useInternationalContactLookup.ts": "Performs international contact lookups via the backend actor and exposes loading, error, and reset state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, handling login, logout, and identity loading. Wraps Dfinity AuthClient with custom options and exposes status flags.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status and returns simple flags. Adds event listeners for connectivity changes.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder hook file for PWA installation logic.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder hook file for managing cooldown before showing PWA install prompts.",
  "frontend/src/hooks/useSubmitLookupReport.ts": "Submits hybrid anonymous/authenticated contact reports to the backend and manages loading, success, and localized error state. Maps contact type to backend enum and exposes a reset function.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and saves per-identity user history in local storage and exposes add/clear functions. Syncs history when Internet Identity changes.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state and translation context with Portuguese fallback merging. Persists the chosen language in sessionStorage.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation dictionaries, exposing Portuguese as the base type. Contains app UI strings for multiple locales.",
  "frontend/src/ic/actors.ts": "Creates IC actors for main, extra, and reports canisters using a shared HTTP agent pointing to ic0.app. Exposes helper functions to instantiate each actor type.",
  "frontend/src/ic/canisterIds.ts": "Stores canonical canister IDs and provides a lookup function by canister type. Centralizes IDs for main, extra, and reports canisters.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid interface for the extra canister with phone and crypto report queries. Exports TypeScript interface for typed actor usage.",
  "frontend/src/ic/idl/main.idl.ts": "Defines the main canister Candid interface for text analysis. Exports a typed interface with a single analyzeText method.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines Candid types and service methods for submitting and querying reports across multiple categories. Exports TypeScript interfaces for all report structures and actor methods.",
  "frontend/src/ic/readinessReport.ts": "Generates a readiness report indicating canister availability and method presence, and provides a logger for debugging environment status.",
  "frontend/src/index.css": "Tailwind setup defining extensive light/dark theme CSS variables, global styles, accessibility enhancements, and mobile touch-target adjustments.",
  "frontend/src/main.tsx": "Entry point rendering the App with React Query and Internet Identity providers and loading global CSS.",
  "frontend/src/pages/DocumentationPage.tsx": "Documentation page with SEO setup that displays content sections and triggers PDF generation.",
  "frontend/src/pages/HomePage.tsx": "Main homepage offering message, email, phone, and crypto fraud analysis with tabbed inputs and result rendering.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains verification methods and scoring through accordion sections with SEO setup.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty file placeholder for the institutional mission page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty file placeholder for the institutional page.",
  "frontend/src/pages/InternationalContactSearchPage.tsx": "Page enabling validated international contact lookup with backend queries and error handling.",
  "frontend/src/pages/MissionPage.tsx": "Mission page rendering translated vision, core mission, social impact, and values sections with SEO setup.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the privacy policy page using translated content, dynamic SEO, and multiple structured sections.",
  "frontend/src/pages/TermsPage.tsx": "Displays the terms and conditions page with translated text, SEO setup, and sectioned content blocks.",
  "frontend/src/pwa/install.ts": "Handles deferred PWA install prompt events and provides a trigger function to request installation.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal client-side router with shared state, navigation events, and a navigate helper.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Provides text normalization and keyword/phrase matching utilities for antifraud heuristics.",
  "frontend/src/utils/contactInputHeuristics.ts": "Detects, normalizes, and validates phone or email input using basic heuristics and multilingual error messages.",
  "frontend/src/utils/documentationContent.ts": "Builds a structured documentation object using Portuguese translations for institutional and product content.",
  "frontend/src/utils/emailHeuristics.ts": "Analyzes email strings for scam indicators using deterministic pattern checks.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates and downloads a text-based documentation file assembled from structured content.",
  "frontend/src/utils/highRiskPhrases.ts": "Defines high‑ and medium‑risk phrase patterns with categories and weights for fraud detection, supporting multilingual fragment matching.",
  "frontend/src/utils/localRateLimit.ts": "Implements a client‑side cooldown using localStorage to limit how often fraud reports can be submitted.",
  "frontend/src/utils/messageHeuristics.ts": "Provides a heuristic text analyzer that scores messages for scam indicators, crypto patterns, URLs, and formatting anomalies.",
  "frontend/src/utils/publicContactLookup.ts": "Loads and queries a same‑origin JSON dataset for public contact information keyed by phone or email.",
  "frontend/src/utils/publicSourceProviders.ts": "Aggregates public‑source checks using local lookup data and placeholder logic for future external providers.",
  "frontend/src/utils/riskScoring.ts": "Computes a 0–100 fraud risk score from weighted factors and maps numeric scores to Low/Medium/High levels.",
  "frontend/src/utils/riskWeights.ts": "Defines configurable default weights and thresholds used by the risk‑scoring engine.",
  "frontend/src/utils/seo.ts": "Updates document title and meta description to maintain consistent site SEO branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Implements a structured, multilingual fraud‑analysis engine combining keyword patterns, scoring, and templated explanations.",
  "frontend/src/utils/translateBackendResult.ts": "Translates backend Portuguese analysis text into other languages using a dictionary‑based replacement system.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/src/utils/userProfileStorage.ts": "Manages per‑principal user profiles in localStorage, storing history items and optional language preferences.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, typography, animations, and container settings with custom theme tokens.",
  "project_state.json": "Stores the project’s UI-only requirements, i18n expansion plan, footer update goals, constraints, and known issues for build planning."
}