{
  "backend/main.mo": "Defines core backend actor with types, access control, user profiles, report storage, international contact lookup, and terms document handling.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files used for build planning.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry point loading the React app and PWA manifest/icons.",
  "frontend/LIVE_INTEGRATION_RESTART_RUNBOOK.md": "Runbook describing steps to restart live integration cleanly after failure.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming no frontend changes are required for Phase 3a read‑only canister integration.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Checklist for validating a clean production build including routing, consent modal, branding, and antifraud analysis behavior.",
  "frontend/public/404.html": "SPA fallback page that auto-redirects known routes back to the app shell.",
  "frontend/public/data/public-contact-lookup.json": "Static dataset mapping known phone and email contacts to public directory metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and launch behavior.",
  "frontend/public/service-worker.js": "Service worker handling precaching, network‑first fetch strategy, and offline fallback.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Android Chrome WebAPK test procedure verifying real WebAPK installation vs shortcut.",
  "frontend/scripts/live-integration-complete.mjs": "Wrapper script that runs the restart integration script and outputs a single success line if valid.",
  "frontend/scripts/restart-live-integration.mjs": "Build workflow script that cleans artifacts, verifies files, installs deps, builds, and outputs a fixed success message.",
  "frontend/src/App.tsx": "Root React app handling routing, consent gate, PWA setup, and page rendering.",
  "frontend/src/backend.idl.ts": "IDL definition exposing a single analyzeText function.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component performing contact-type detection, public lookup, antifraud analysis, caching, and offline behavior.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "UI card displaying analysis risk, explanation, public info, and reporting options.",
  "frontend/src/components/AppLayout.tsx": "Main layout component providing header, navigation, mobile menu, and footer while handling route-based menu behavior.",
  "frontend/src/components/AuthControl.tsx": "Authentication UI that shows login button or user profile menu based on Internet Identity state.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results including risk score, report count, categories, and messages for loading or errors.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal that requires users to accept cookies and terms before proceeding, with links to terms and privacy pages.",
  "frontend/src/components/CookieStorageSettingsModal.tsx": "Modal for viewing stored local data and clearing cached history and user data.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Footer displaying branding, current year, and external links with official seals.",
  "frontend/src/components/InstallButton.tsx": "Button that triggers PWA installation and alerts users if installation is not available.",
  "frontend/src/components/InternationalContactSearchResult.tsx": "Displays international contact risk details with score, country info, trust score, and source links using badges and icons.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown for switching UI languages with a button showing the current language.",
  "frontend/src/components/PublicEntitySeals.tsx": "Renders grouped seals from public institutions (Portugal, USA, EU) with icons and external links.",
  "frontend/src/components/PwaInstallAction.tsx": "Button that triggers PWA installation using a provided install handler.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting anonymous or authenticated reports with category selection, description, and success/error handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Card component showing structured fraud analysis results including risk level, explanation, recommendation, and sources.",
  "frontend/src/components/TermsContent.tsx": "Renders terms of service sections with headings, paragraphs, and optional public entity seals.",
  "frontend/src/components/TermsModal.tsx": "Modal that displays the terms content inside a scrollable dialog window.",
  "frontend/src/components/UserProfileMenu.tsx": "Renders a user profile menu showing identity info, cookie settings, and searchable history with clear actions.",
  "frontend/src/config/features.ts": "Defines feature-flag interface, default values, and helpers for checking PRO and external provider enablement.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Provides localStorage-backed caching for phone and email lookup results with add, retrieve, and clear utilities.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes main, extra, and report canister actors using Internet Identity and logs readiness once per load.",
  "frontend/src/hooks/useConsentGate.ts": "Tracks whether the user has accepted current terms, storing acceptance in localStorage and exposing consent state.",
  "frontend/src/hooks/useInternationalContactLookup.ts": "Performs international contact lookups via backend actor and returns results or fallback data with loading/error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities and exposing login, logout, and status flags.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks if the current authenticated user is an admin using the backend actor with cached query behavior.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status via event listeners.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder file.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder file.",
  "frontend/src/hooks/useSubmitLookupReport.ts": "Submits spam/phishing/scam reports to backend with loading, success, and error state handling.",
  "frontend/src/hooks/useTermsDocument.ts": "Fetches the current terms document from the backend actor with loading and error indicators.",
  "frontend/src/hooks/useUserProfile.ts": "React hook managing user profile history tied to Internet Identity, with load, add, and clear functions stored in local storage.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides i18n context with persisted language selection and fallback translation merging from Portuguese.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation keys, providing the full Portuguese base dictionary.",
  "frontend/src/ic/actors.ts": "Creates DFINITY canister actors for main, extra, and reports canisters using a shared HttpAgent.",
  "frontend/src/ic/canisterIds.ts": "Exports static canister IDs and a helper to resolve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Candid IDL and TS interface for the Extra canister exposing phone and crypto report lookups.",
  "frontend/src/ic/idl/main.idl.ts": "Candid IDL and TS interface for the Main canister providing text analysis.",
  "frontend/src/ic/idl/reports.idl.ts": "Candid IDL and TS interfaces for submitting fraud reports and querying email, phone, message, and crypto lookups.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report validating actors and method availability for all canisters.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode, accessibility rules, and mobile touch targets.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/pages/AdminTermsPage.tsx": "Admin page for viewing and updating the terms document with form inputs, validation, and canister update calls.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders a documentation page with SEO setup, content overview, and a button to generate a PDF. Manages loading state while generating the document.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with fraud‑analysis tools for messages, email, phone, and crypto, handling user input, validation, and displaying structured results.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays explanations of verification methods and processes using accordion sections and sets SEO metadata. Provides structured descriptions for email, phone, message, and crypto checks.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/InternationalContactSearchPage.tsx": "Implements an international contact lookup with input validation, normalization, backend lookup calls, and SEO setup. Shows results, errors, and loading states.",
  "frontend/src/pages/MissionPage.tsx": "Renders mission‑related sections such as vision, core mission, social impact, and values, pulling text from translations and setting SEO metadata.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays privacy policy sections dynamically from translation data and sets SEO metadata. Includes header and multiple content cards.",
  "frontend/src/pages/TermsPage.tsx": "Sets SEO metadata and renders the terms content component with optional seals.",
  "frontend/src/pwa/install.ts": "Manages PWA install prompt events by storing the deferred prompt and triggering installation when requested.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal client-side router using shared state, custom navigation events, and the History API.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Provides text normalization and keyword/phrase matching utilities with accent-insensitive and partial matching support.",
  "frontend/src/utils/contactInputHeuristics.ts": "Detects, normalizes, and validates phone and email inputs with simple heuristics and multilingual error messages.",
  "frontend/src/utils/documentationContent.ts": "Builds structured institutional documentation content using translation data and predefined sections.",
  "frontend/src/utils/emailHeuristics.ts": "Analyzes email addresses for fraud risk using deterministic checks for domains, TLDs, patterns, and suspicious formats.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates and downloads a text-based documentation file by assembling structured documentation content.",
  "frontend/src/utils/highRiskPhrases.ts": "Defines high- and medium-risk phrase patterns with categories and weights for fraud detection heuristics.",
  "frontend/src/utils/localRateLimit.ts": "Implements a simple localStorage-based rate limiter with a 1-minute cooldown for submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Implements keyword, URL, crypto, and formatting–based scam scoring to classify message risk.",
  "frontend/src/utils/phoneCountry.ts": "Extracts country names from phone numbers by matching leading international codes.",
  "frontend/src/utils/publicContactLookup.ts": "Loads a same-origin JSON dataset and looks up public contact metadata by normalized phone or email keys.",
  "frontend/src/utils/publicSourceProviders.ts": "Aggregates public‑source presence info using local lookup and optional future external providers.",
  "frontend/src/utils/riskScoring.ts": "Computes 0‑100 risk scores from factor weights and maps scores to Low/Medium/High levels.",
  "frontend/src/utils/riskWeights.ts": "Defines default risk scoring weights and thresholds and exports a shared configuration object.",
  "frontend/src/utils/seo.ts": "Sets document title and meta description for runtime SEO branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Runs structured fraud analysis using keyword rules, scoring, and localized explanation templates.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary-based translation of Portuguese backend analysis text into other languages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for extracting, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/userProfileStorage.ts": "Provides localStorage-based CRUD utilities for user profiles, history items, and consent/cache clearing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, breakpoints, animations, and plugin integrations.",
  "project_state.json": "Holds project metadata, architectural constraints, feature definitions, and pending requests for antifraud logic updates."
}