{
  "backend/main.mo": "Defines stable maps for phone and crypto reports and exposes read‑only query methods to fetch report counts.",
  "feature_evidence.json": "Lists feature evidence entries detailing features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files used for build planning and reference.",
  "frontend/index.css": "Tailwind base styles configuring OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point defining AntiFraud branding, metadata, manifest link, and root app mount.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming that Phase 3a adds a read‑only canister requiring no frontend code changes.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying AntiFraud name, colors, start URL, and PNG icons.",
  "frontend/src/App.tsx": "Main app component wiring routing, i18n, authentication provider, and page rendering.",
  "frontend/src/backend.idl.ts": "Candid IDL defining the backend canister's analyzeText function.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation, language selector, auth controls, and footer.",
  "frontend/src/components/AuthControl.tsx": "Authentication UI that handles Internet Identity login and shows a profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results including risk score, report count, categories, and disclaimers with loading and error handling.",
  "frontend/src/components/DashboardQuickActions.tsx": "Renders quick-action buttons for checking risk, searching the database, reporting, and installing the PWA.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown menu for selecting the app's language, showing current language and switching on click.",
  "frontend/src/components/PwaInstallAction.tsx": "Shows a PWA install button or an instruction dialog depending on platform support and installability.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Implements a dialog for submitting fraud reports with validation, rate limiting, and success handling.",
  "frontend/src/components/UserProfileMenu.tsx": "Displays user info, search history with clearing options, and a logout button using Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and tracks multiple canister actors (main, extra, reports) based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, logout, and stored identity loading.",
  "frontend/src/hooks/usePwaInstall.ts": "React hook that detects PWA installability, tracks platform and install state, and exposes a method to trigger installation and show instructions.",
  "frontend/src/hooks/useUserProfile.ts": "Manages per-identity user history using local storage, allowing adding and clearing recent activity.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language context, persists selected language in sessionStorage, and exposes translation strings.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and the full translation string interface used across the app.",
  "frontend/src/ic/actors.ts": "Creates Dfinity IC actors for main, extra, and reports canisters using a shared agent.",
  "frontend/src/ic/canisterIds.ts": "Stores static canister IDs and provides a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid interface for extra canister with phone and crypto report lookup queries.",
  "frontend/src/ic/idl/main.idl.ts": "Defines Candid interface for main canister exposing text analysis.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines Candid interface for reports canister including report submission and multi‑type lookup methods.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme variables and accessibility/touch‑target adjustments.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Main UI page managing state and actions for phone, crypto, message, and email checks plus collaborative results and reporting.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Renders the institutional mission page with hero, vision, mission, and values sections using i18n text and UI cards.",
  "frontend/src/pages/InstitutionalPage.tsx": "Displays institutional information including core features and accordion-based detailed explanations using translated content.",
  "frontend/src/pages/TermsPage.tsx": "Shows a terms and conditions page with multiple i18n-driven sections rendered inside cards.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal router hook tracking the current route and updating history for navigation.",
  "frontend/src/utils/emailHeuristics.ts": "Provides deterministic client-side email risk checks using domain, TLD, typosquat, and pattern heuristics.",
  "frontend/src/utils/localRateLimit.ts": "Implements localStorage-based rate limiting with a 1‑minute cooldown for submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Scores messages for scam risk using keyword weights, crypto/URL detection, punctuation, and capitalization heuristics.",
  "frontend/src/utils/translateBackendResult.ts": "Maps common Portuguese scam-analysis terms to multiple languages using static dictionary lookups.",
  "frontend/src/utils/userProfileStorage.ts": "Provides interfaces for user history and profile and utilities to load, save, and clear user profiles in localStorage keyed by principal.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, typography, container settings, animations, and plugin integrations for the frontend.",
  "project_state.json": "Defines the current AntiFraud project scope, branding rules, backend integration requirements, phased analysis plan, and known issues for development."
}