{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus read-only phone and crypto report lookup maps.",
  "feature_evidence.json": "Feature evidence metadata linking features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, UI, i18n, and backend interaction.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, dark mode variables, and global layout styles.",
  "frontend/index.html": "Main HTML entry point loading the React app with icons, manifest, and AntiFraud branding.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation stating that Phase 3a adds a read‑only canister requiring no frontend code changes.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, display mode, and scope.",
  "frontend/public/service-worker.js": "Service worker handling caching, app shell installation, cache cleanup, and network-first fetch behavior.",
  "frontend/src/App.tsx": "Sets up the main app with routing, consent gating, PWA initialization, and page rendering based on normalized routes.",
  "frontend/src/backend.idl.ts": "Defines the Internet Computer IDL service containing a single analyzeText function.",
  "frontend/src/components/AppLayout.tsx": "Provides the main layout with header, navigation, language selector, auth control, and mobile menu handling.",
  "frontend/src/components/AuthControl.tsx": "Handles Internet Identity login/logout UI and displays the user profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative fraud‑related lookup results with risk score, categories, and disclaimers.",
  "frontend/src/components/ConsentGateModal.tsx": "Renders a blocking consent modal requiring acceptance of cookies, terms, and privacy before accessing the app.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/InstitutionalPageLayout.tsx": "Provides a structured layout for institutional pages with title, optional subtitle, description, and section content.",
  "frontend/src/components/LanguageSelector.tsx": "Implements a dropdown for selecting the app’s language from a predefined list.",
  "frontend/src/components/PwaInstallAction.tsx": "Shows install prompts or instructions for installing the app as a PWA depending on platform and installability.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog component handling report submission with validation, rate limiting, and form state management.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud analysis results including risk level, explanation, and recommendation.",
  "frontend/src/components/UserProfileMenu.tsx": "User menu showing identity info, search history, and logout controls.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to the user's identity and invalidating dependent queries.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Hook initializing multiple anti‑fraud canister actors and logging a readiness report once.",
  "frontend/src/hooks/useConsentGate.ts": "Manages storing and checking user consent version in localStorage and exposing a flag to require consent.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and loading stored identities.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installation state, detects platform, polls for deferred install prompts, and exposes install action and instructions.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and manages per-identity user history using local storage, allowing adding and clearing of recent activity.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language context with session‑stored selection and translation lookup via a React context provider.",
  "frontend/src/i18n/translations.ts": "Contains the Portuguese translation dictionary for UI text including navigation, documentation, consent, and verification labels.",
  "frontend/src/ic/actors.ts": "Creates Dfinity canister actors for main, extra, and reports canisters using a shared HttpAgent.",
  "frontend/src/ic/canisterIds.ts": "Defines static canister IDs and a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "IDL and TypeScript interface for extra canister queries to get phone and crypto report counts.",
  "frontend/src/ic/idl/main.idl.ts": "IDL and interface for the main canister’s analyzeText update method.",
  "frontend/src/ic/idl/reports.idl.ts": "IDL and types for submitting reports and querying email, phone, message, and crypto lookup results.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report validating canister IDs and available actor methods.",
  "frontend/src/index.css": "Global Tailwind-based styling with high‑contrast variables, typography rules, and accessibility-focused defaults.",
  "frontend/src/main.tsx": "App entry point wiring React Query, Internet Identity provider, global styles, and rendering the root App component.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders a documentation page with SEO metadata, content overview, and a button to generate a PDF. Handles PDF generation state and displays translated text sections.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home page with message, email, phone, and crypto fraud analysis tools using tabs. Manages input state, validation, and displays structured analysis results.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an informational page explaining verification methods with accordions and translated paragraphs. Sets SEO metadata and uses a shared institutional layout.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder file for an institutional mission page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder file for a generic institutional page.",
  "frontend/src/pages/MissionPage.tsx": "Renders a mission-focused institutional page with sections for vision, core mission, impact, values, and limitations. Loads translated content and sets SEO metadata.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays a multi‑section privacy policy page with translated paragraphs and SEO metadata. Uses a shared institutional layout with cards and separators for each policy section.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms and Conditions page with multiple sections using translations and SEO setup.",
  "frontend/src/pwa/pwaRuntime.ts": "Implements a singleton to manage service worker registration and PWA installation prompts.",
  "frontend/src/router/useSimpleRouter.ts": "Provides a minimal client-side router with navigation events and optional navigation guards.",
  "frontend/src/utils/documentationContent.ts": "Builds a structured documentation object using Portuguese translation strings for institutional pages.",
  "frontend/src/utils/emailHeuristics.ts": "Analyzes email strings with heuristic checks for suspicious domains, TLDs, patterns, and formats.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates a downloadable text file containing formatted documentation content.",
  "frontend/src/utils/localRateLimit.ts": "Implements a simple localStorage-based cooldown to rate-limit user submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Scores messages for scam indicators using keyword, crypto, URL, and formatting heuristics.",
  "frontend/src/utils/seo.ts": "Sets document title and meta description dynamically for SPA SEO.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Defines localized heuristic fraud analysis templates and result types for frontend-only risk scoring.",
  "frontend/src/utils/translateBackendResult.ts": "Provides dictionary-based translation of backend scam-analysis text into multiple target languages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including sessionStorage handling and hash-based routing support.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profile history and language settings via localStorage with basic load/save/clear helpers.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, typography, animations, and layout settings.",
  "project_state.json": "Describes project state and pending targeted fixes for PWA behavior, consent modal enforcement, and layout adjustments."
}