{
  "backend/main.mo": "Defines a canister with two persistent maps storing report counts and exposes read‑only query methods for phone and crypto lookups.",
  "feature_evidence.json": "Lists feature evidence entries describing required pages, routing updates, multilingual content, and associated files and components.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for numerous frontend files used for build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens and dark‑mode values for global styling.",
  "frontend/index.html": "HTML entry point setting metadata, icons, manifest, and mounting the React root.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming no frontend changes are required for Phase 3a and explaining why the new read‑only canister is not yet integrated.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, icons, start URL, theme colors, and display configuration.",
  "frontend/public/service-worker.js": "Service worker implementing caching, app shell routing, and network‑first fetch handling for offline support.",
  "frontend/src/App.tsx": "Main React app wiring providers, setting document title, and routing to mission, how‑it‑works, terms, privacy, or home with legacy path normalization.",
  "frontend/src/backend.idl.ts": "Candid IDL definition exposing only the analyzeText method for the backend canister.",
  "frontend/src/components/AppLayout.tsx": "Shared layout rendering header, navigation, mobile menu, language selector, auth controls, and wrapping page content.",
  "frontend/src/components/AuthControl.tsx": "Handles login via Internet Identity and shows a profile dropdown when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, and error or empty states.",
  "frontend/src/components/DashboardQuickActions.tsx": "Provides quick‑action buttons for checking risk, searching the database, reporting scams, and installing the PWA.",
  "frontend/src/components/LanguageSelector.tsx": "Offers a dropdown for selecting the app language from predefined options.",
  "frontend/src/components/PwaInstallAction.tsx": "Shows an install button or instructions for adding the PWA depending on installability and platform.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Renders a dialog for submitting scam reports with validation, rate‑limit checks, and success handling.",
  "frontend/src/components/UserProfileMenu.tsx": "Shows user principal info, search history with clearing options, and a logout button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and manages multiple anti‑fraud actors, logging readiness once and exposing fetch state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, loading stored identities, and handling login state. Wraps Dfinity AuthClient setup and exposes login, clear, and status flags.",
  "frontend/src/hooks/usePwaInstall.ts": "Detects PWA installability, tracks installation state, and exposes methods to trigger install prompts and fetch platform-specific instructions. Listens for beforeinstallprompt and appinstalled events.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and stores per-identity user history in local storage and exposes methods to add or clear history entries. Reactively updates history when the authenticated identity changes.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements a language context storing the selected language in sessionStorage and providing translation access. Exposes setLanguage and the active language's translation map.",
  "frontend/src/i18n/translations.ts": "Defines the Portuguese translation dictionary used by the i18n system for UI text. Maps keys for navigation, actions, errors, results, and other labels.",
  "frontend/src/ic/actors.ts": "Creates Dfinity HTTP agents and typed actors for main, extra, and reports canisters using fixed mainnet host. Provides helper functions to instantiate each canister interface.",
  "frontend/src/ic/canisterIds.ts": "Centralizes canister IDs for main, extra, and reports services and exposes a helper to fetch IDs by type. Serves as the canonical source for all canister identifiers.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid interface for the extra canister with phone and crypto report queries. Exports TypeScript interface for corresponding actor methods.",
  "frontend/src/ic/idl/main.idl.ts": "Defines Candid interface for the main canister exposing a text analysis method. Provides the matching TypeScript interface for the actor.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines Candid types and service for submitting and looking up fraud reports across several categories. Exports TypeScript interfaces for requests, results, and actor methods.",
  "frontend/src/ic/readinessReport.ts": "Generates a readiness summary showing available actors and implemented methods for all canisters and logs a formatted report to console. Used to verify canister connectivity and API surface.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes plus accessibility and mobile touch-target adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Implements the main user dashboard for analyzing messages and checking email, phone, and crypto data using backend actors.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an informational page with SEO setup and accordion-based explanations of verification types.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Renders a mission and values page with vision, mission, and value sections sourced from translations.",
  "frontend/src/pages/InstitutionalPage.tsx": "Provides an institutional overview with feature summaries and a detailed accordion explaining workflow steps.",
  "frontend/src/pages/MissionPage.tsx": "Shows a mission-focused informational page with vision, core mission, impact, values, and system limitations sections.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the Privacy Policy page using i18n content and sets SEO metadata, displaying multiple sections from translated text arrays.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service page with i18n-driven section content and sets SEO metadata similarly to the privacy page.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal client-side router using window history, custom navigation events, and a React hook to track the current route.",
  "frontend/src/utils/emailHeuristics.ts": "Provides deterministic email risk analysis by checking domains, TLDs, patterns, and formatting to categorize emails as safe or flagged.",
  "frontend/src/utils/localRateLimit.ts": "Implements a localStorage-based cooldown system to rate-limit actions, returning allowance status and managing timestamps.",
  "frontend/src/utils/messageHeuristics.ts": "Analyzes text for scam indicators using keyword weights, URL and crypto detection, punctuation checks, and assigns a risk score.",
  "frontend/src/utils/seo.ts": "Sets document title and meta description for SPA routes with AntiFraud branding.",
  "frontend/src/utils/translateBackendResult.ts": "Performs simple dictionary-based translation of backend scam analysis text into multiple languages by replacing known terms.",
  "frontend/src/utils/urlParams.ts": "Utilities to read URL parameters (including hash routing), persist them in sessionStorage, and optionally clean them from the URL.",
  "frontend/src/utils/userProfileStorage.ts": "Manages per‑user profiles in localStorage, storing history items and preferences with load, save, and clear utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with custom CSS variables and plugins.",
  "project_state.json": "Defines the project’s current state, scope, branding rules, required pages, PWA requirements, canister integration notes, and known issues."
}