{
  "backend/main.mo": "Actor implementing access‑controlled user profiles and read‑only phone/crypto report queries using Map storage.",
  "feature_evidence.json": "Feature evidence listing transparency‑related frontend changes, affected files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing multiple frontend files and their roles in the project.",
  "frontend/index.css": "Global Tailwind‑based styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Main HTML entry point configuring metadata, icons, manifest, and app root element.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation confirming that Phase 3a introduces no frontend changes for the new read‑only database canister.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the application shell.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining metadata, icons, start URL, theme, and display settings.",
  "frontend/public/service-worker.js": "Service worker implementing basic caching with cache‑then‑network updates for the PWA.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Manual checklist for testing WebAPK installation behavior on Android Chrome.",
  "frontend/src/App.tsx": "Main app component wiring routing, PWA setup, consent gate, and layout using providers.",
  "frontend/src/backend.idl.ts": "Defines the backend canister interface with a single analyzeText function.",
  "frontend/src/components/AppLayout.tsx": "Provides the app’s main layout with navigation, header, mobile menu, and language/auth controls.",
  "frontend/src/components/AuthControl.tsx": "Handles Internet Identity login/logout UI and shows a profile dropdown when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results including risk score, categories, and error/loading states.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal forcing users to accept cookies and terms before interacting with the app.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder component file.",
  "frontend/src/components/InstallButton.tsx": "Button that triggers PWA installation with a fallback alert if not eligible.",
  "frontend/src/components/LanguageSelector.tsx": "Language switcher dropdown allowing selection among multiple supported languages.",
  "frontend/src/components/PwaInstallAction.tsx": "Small button component to trigger PWA installation using localized text.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting scam reports with validation, rate limiting, and success/error handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "UI card showing structured fraud analysis results with risk level, explanation, recommendation, sources, and collaborative basis.",
  "frontend/src/components/UserProfileMenu.tsx": "User profile menu displaying identity info, history entries, and a logout option with localization support.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and manages main, extra, and reports anti-fraud canister actors and logs a one-time readiness report.",
  "frontend/src/hooks/useConsentGate.ts": "Handles local consent state with versioning, determining whether user consent is required and allowing acceptance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, and authentication state.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty file.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty file.",
  "frontend/src/hooks/useUserProfile.ts": "Manages user-specific history stored per principal with add, load, and clear operations.",
  "frontend/src/i18n/I18nProvider.tsx": "I18n provider storing language in sessionStorage and exposing translations and language setter.",
  "frontend/src/i18n/translations.ts": "Provides Portuguese UI translation strings for navigation, documentation, consent modal, home page, verification, and analysis features.",
  "frontend/src/ic/actors.ts": "Creates DFINITY HttpAgent and typed canister actors for main, extra, and reports canisters using their IDL factories.",
  "frontend/src/ic/canisterIds.ts": "Defines hardcoded canister IDs and a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "IDL and interface for the extra canister, exposing phone and crypto report lookup queries.",
  "frontend/src/ic/idl/main.idl.ts": "IDL and interface for the main canister, exposing a text analysis update method.",
  "frontend/src/ic/idl/reports.idl.ts": "IDL and interfaces for submitting reports and querying lookup data across multiple report types.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report checking actor availability and method presence for all canisters.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables, base styles, and accessibility-focused UI adjustments.",
  "frontend/src/main.tsx": "Application entry point setting up React root with query client and Internet Identity provider.",
  "frontend/src/pages/DocumentationPage.tsx": "React page that displays documentation info and triggers PDF generation with translated UI text.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with tabs to analyze messages, emails, phone numbers, and crypto addresses using fraud‑analysis utilities.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains verification methods using accordion sections and sets SEO metadata via translations.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/MissionPage.tsx": "Renders mission, vision, values, and limitations content using translated text and SEO metadata.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays privacy policy sections with translated text and SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Shows terms and conditions sections with translated text and SEO metadata.",
  "frontend/src/pwa/install.ts": "Handles PWA install prompt events and exposes functions to trigger installation.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal client‑side router using history API and custom navigation events.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Provides text normalization and keyword‑matching helpers for antifraud heuristics.",
  "frontend/src/utils/documentationContent.ts": "Defines the documentation structure and builds Portuguese institutional content using translation data.",
  "frontend/src/utils/emailHeuristics.ts": "Implements deterministic frontend email risk checks using domain, TLD, pattern, and formatting heuristics.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates and downloads a text-based documentation file by assembling structured content into a formatted output.",
  "frontend/src/utils/localRateLimit.ts": "Provides a simple localStorage-based cooldown mechanism for rate-limiting submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Scores messages for scam indicators using keyword weights, crypto detection, URL checks, and formatting heuristics.",
  "frontend/src/utils/seo.ts": "Sets document title and meta description for SPA pages with enforced branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Implements a structured heuristic fraud analysis engine with localized templates and indicator labeling.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary-based translation of backend analysis text into multiple target languages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (query or hash), persist them in sessionStorage, retrieve them later, and optionally clear them from the URL.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profile data in localStorage, including history items and preferred language, with functions to load, save, and clear profiles per principal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theming, colors, typography, animations, and container settings with plugin support.",
  "project_state.json": "Captures the project’s current state, architectural notes, issues, and PWA-related requirements for phased AntiFraud app development."
}