{
  "backend/main.mo": "Defines core types, storage maps, access control, user profiles, and report structures for the backend canister.",
  "feature_evidence.json": "Lists features, related files, components, test IDs, and confidence levels for implemented functionality.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files and their roles in the application.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens and theme variables for light/dark modes.",
  "frontend/index.html": "Main HTML entry point loading the React app and setting PWA-related metadata.",
  "frontend/LIVE_INTEGRATION_RESTART_RUNBOOK.md": "Runbook detailing steps for restarting and validating a clean live integration workflow.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Explains that Phase 3a requires no frontend changes and documents verification and reasoning.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Checklist for validating production builds including cleanup, core functionality tests, and i18n checks.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell.",
  "frontend/public/data/public-contact-lookup.json": "Static lookup table for known public phone and email contacts with metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app identity, icons, colors, and launch settings.",
  "frontend/public/service-worker.js": "Service worker implementing precaching and a network‑first strategy with offline fallback.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Checklist for confirming Android Chrome generates a real WebAPK installation.",
  "frontend/scripts/live-integration-complete.mjs": "Wrapper script that runs the restart integration script and emits a single success line if valid.",
  "frontend/scripts/restart-live-integration.mjs": "Script performing clean build preparation, dependency checks, builds, and verification for production integration.",
  "frontend/src/App.tsx": "Main React application wiring routing, providers, consent gate, and service worker registration.",
  "frontend/src/backend.idl.ts": "IDL definition exposing a single analyzeText canister method.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component handling contact analysis flow, including type detection, public lookup, caching, and offline behavior.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "UI card displaying detailed analysis results, risk scoring, public info, and reporting options.",
  "frontend/src/components/AppLayout.tsx": "Responsive app layout with header, navigation, mobile menu, language selector, auth controls, and routing integration.",
  "frontend/src/components/AuthControl.tsx": "Authentication UI that shows login button or user profile menu based on Internet Identity state.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, report count, and error/empty states.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring users to accept cookies and terms before proceeding, with links to policy pages.",
  "frontend/src/components/CookieStorageSettingsModal.tsx": "Dialog showing stored data categories and allowing users to clear local history and cached data.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright text and external partner seals with links.",
  "frontend/src/components/InstallButton.tsx": "Button to trigger PWA installation and show an alert if installation is not available.",
  "frontend/src/components/InternationalContactSearchResult.tsx": "Displays an international contact's risk, scores, country validation, and trust info with icons and badges.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown to switch application languages using the i18n provider.",
  "frontend/src/components/PublicEntitySeals.tsx": "Shows official seals for Portugal, USA, and EU with links and icons grouped by region.",
  "frontend/src/components/PublicLocationResults.tsx": "Renders public location search results with fixed low risk, showing entity details and handling errors or empty states.",
  "frontend/src/components/PwaInstallAction.tsx": "Button component that triggers the PWA installation flow via a helper function.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting lookup reports with category selection, description, anonymity info, and success/error states.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud analysis with risk level, explanation, recommendation, and source links.",
  "frontend/src/components/TermsContent.tsx": "Renders a terms-of-service page using i18n content, mapping sections into cards and optionally showing public entity seals.",
  "frontend/src/components/TermsModal.tsx": "Displays TermsContent inside a dialog with scrollable content and localized title.",
  "frontend/src/components/UserProfileMenu.tsx": "Shows user identity info, cookie settings, and activity history with actions to clear it.",
  "frontend/src/config/features.ts": "Defines feature-flag interface, defaults, and helpers for checking PRO and external provider availability.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Manages localStorage-backed caching of contact lookup results with add, retrieve, and clear utilities.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and tracks main, extra, and reports canister actors and logs a readiness report once.",
  "frontend/src/hooks/useConsentGate.ts": "Handles persisted consent state, requiring re-consent when the terms version changes.",
  "frontend/src/hooks/useInternationalContactLookup.ts": "Provides a lookup method using the backend actor and returns detailed or fallback contact data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, initialization, login, logout, and context access.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks admin status via actor.isAdmin using react-query and returns isAdmin and loading state.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status and exposes isOnline and isOffline flags.",
  "frontend/src/hooks/usePublicLocationSearch.ts": "Provides a search function for public locations with loading, result, and error state management.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty file.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty file.",
  "frontend/src/hooks/useSubmitLookupReport.ts": "Submits lookup reports to the backend canister and manages submission loading, success, and error states.",
  "frontend/src/hooks/useTermsDocument.ts": "Fetches the current terms document via actor.getCurrentTerms with react-query and exposes loading and error states.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and updates per‑user profile history in local storage based on Internet Identity principal.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, session persistence, and translated strings with Portuguese fallback.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation strings with Portuguese as the base definition.",
  "frontend/src/ic/actors.ts": "Creates IC HTTP agents and typed actors for the main, extra, and reports canisters.",
  "frontend/src/ic/canisterIds.ts": "Exports static canister IDs and a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid IDL and TypeScript interface for extra canister phone and crypto report queries.",
  "frontend/src/ic/idl/main.idl.ts": "Defines IDL and interface for the main canister’s analyzeText method.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines IDL and interfaces for submitting reports and performing lookup queries across multiple report types.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report showing canister IDs and available actor methods.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes, plus global styles and accessibility rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/AdminTermsPage.tsx": "Admin interface for viewing and updating terms of service, with validation, loading states, and permission checks.",
  "frontend/src/pages/DocumentationPage.tsx": "Documentation page that displays sections and triggers PDF generation with loading feedback.",
  "frontend/src/pages/HomePage.tsx": "Home page offering multiple fraud‑analysis tools for messages, emails, phone numbers, and crypto with tabbed UI.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains verification methods and scoring via accordion sections with localized text.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/InternationalContactSearchPage.tsx": "Provides international contact lookup with validation, normalized input handling, and backend search integration.",
  "frontend/src/pages/MissionPage.tsx": "Renders the mission page with vision, mission, impact, and values sections using i18n text and SEO setup.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays the privacy policy with multiple dynamic sections and sets page SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Sets SEO metadata and renders the TermsContent component.",
  "frontend/src/pwa/install.ts": "Handles PWA install prompt capture and exposes functions to trigger installation.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a minimal client-side router with custom navigation events and state syncing.",
  "frontend/src/search/publicLocationSearch.ts": "Detects public‑location queries and fetches matching entities from OSM Nominatim with normalization and parsing.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Provides text‑normalization utilities and keyword/phrase matching and counting helpers.",
  "frontend/src/utils/contactInputHeuristics.ts": "Detects, normalizes, and validates phone and email inputs with basic heuristics and localized errors.",
  "frontend/src/utils/documentationContent.ts": "Builds a structured Portuguese documentation object with branding, institutional pages, terms, privacy, and an appendix using translation data.",
  "frontend/src/utils/emailHeuristics.ts": "Implements deterministic email risk checks based on domains, TLDs, typosquatting, randomness, and format to classify emails as safe or flagged.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates a downloadable text-based documentation file by assembling content from the documentation generator and creating a browser-side file download.",
  "frontend/src/utils/highRiskPhrases.ts": "Defines high- and medium‑risk phrase patterns used to detect fraud indicators in messages through fragment matching.",
  "frontend/src/utils/localRateLimit.ts": "Provides a simple localStorage‑based cooldown system to limit report submissions and track remaining wait time.",
  "frontend/src/utils/messageCriticalTriggers.ts": "Lists critical high‑risk trigger phrases that immediately elevate message fraud risk across financial, urgency, threat, and impersonation themes.",
  "frontend/src/utils/messageHeuristics.ts": "Scores message text for fraud risk using keyword weights, crypto patterns, links, punctuation, and casing to produce a risk level.",
  "frontend/src/utils/phoneCountry.ts": "Maps phone numbers to countries by matching leading E.164 codes after normalization, returning 'Unknown' when unmatched.",
  "frontend/src/utils/publicContactLookup.ts": "Loads and caches a same-origin JSON dataset to look up public contact info by normalized phone or email keys.",
  "frontend/src/utils/publicSourceProviders.ts": "Checks public-source presence using the local dataset and prepares for future external providers, returning matched sources and info.",
  "frontend/src/utils/riskScoring.ts": "Computes a weighted 0-100 fraud risk score and maps numeric scores to Low/Medium/High levels.",
  "frontend/src/utils/riskWeights.ts": "Defines default risk scoring weights and thresholds and exports them as a shared configuration object.",
  "frontend/src/utils/seo.ts": "Sets the document title and optionally updates the meta description for SEO consistency.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Implements a heuristic fraud analysis engine combining keyword rules, scoring, and templates to produce structured risk results.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary-based translation of backend Portuguese analysis text into other languages without altering meaning.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using both query strings and hash routing.",
  "frontend/src/utils/userProfileStorage.ts": "Manages user profiles and history in localStorage, including saving, loading, and clearing user-related data.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and container settings for the frontend.",
  "project_state.json": "Tracks project phase, architectural notes, existing features, and new feature requests for a frontend-only public‑location search using OpenStreetMap Nominatim. Specifies constraints like no backend changes, UI restructuring, or scoring‑engine modifications."
}