{
  "backend/main.mo": "Defines backend actor with authorization, user profiles, report storage, international contact lookup types, and persistent maps for reports and provider configs.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for international contact lookup and routing updates.",
  "frontend-file-summaries.txt": "Provides short descriptions of multiple frontend files including routing, components, translations, and config.",
  "frontend/index.css": "Tailwind‑based global stylesheet defining OKLCH color tokens, theming variables, and dark mode overrides.",
  "frontend/index.html": "Main HTML entry point loading the React app and PWA metadata.",
  "frontend/LIVE_INTEGRATION_RESTART_RUNBOOK.md": "Runbook describing steps to restart and re‑execute the live integration workflow cleanly.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Explains that Phase 3a’s read‑only database canister requires no frontend changes and lists verification points.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Production build checklist covering routing, consent gate, branding, analysis behavior, and PWA validation.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell.",
  "frontend/public/data/public-contact-lookup.json": "Static dataset mapping phone numbers and emails to public directory metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, and launch configuration.",
  "frontend/public/service-worker.js": "Service worker implementing precaching and a network‑first strategy with offline fallback.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Checklist for verifying WebAPK installation on Android via Chrome, including cleanup and validation steps.",
  "frontend/scripts/live-integration-complete.mjs": "Wrapper script running the restart integration script and emitting a single success message.",
  "frontend/scripts/restart-live-integration.mjs": "Integration helper performing cleanup, dependency checks, builds, and emitting a fixed success string.",
  "frontend/src/App.tsx": "Main React application routing pages, registering the service worker, and handling consent gating.",
  "frontend/src/backend.idl.ts": "IDL definition exposing a simple analyzeText API endpoint.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component handling phone/email antifraud lookup with caching, backend queries, and public-source checks.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "UI card rendering antifraud scores, public info, and reporting actions for a lookup result.",
  "frontend/src/components/AppLayout.tsx": "Main app layout with header, navigation, mobile menu, and footer handling route changes and localization.",
  "frontend/src/components/AuthControl.tsx": "Handles login/logout UI using Internet Identity and shows a profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results with risk score, categories, and error/empty states.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring acceptance of cookies and terms before continuing, with navigation to terms/privacy pages.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Footer showing branding, ICP security link, public data sources, and Portuguese entities.",
  "frontend/src/components/InstallButton.tsx": "Button that triggers PWA installation and alerts if installation isn't eligible.",
  "frontend/src/components/InternationalContactSearchResult.tsx": "Card showing international contact risk details, country info, scores, and external validation links.",
  "frontend/src/components/LanguageSelector.tsx": "Language switcher dropdown for selecting supported languages using the i18n provider.",
  "frontend/src/components/PwaInstallAction.tsx": "Small PWA install button that triggers installation using shared PWA handler.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for submitting anonymous or authenticated reports with category selection, optional description, and success/error states.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud analysis results including risk level, explanation, recommendations, sources, and collaborative basis.",
  "frontend/src/components/UserProfileMenu.tsx": "User menu showing authenticated principal, lookup history with clearing option, and logout button.",
  "frontend/src/config/features.ts": "Defines feature-flag configuration with defaults and helpers for checking PRO and external provider availability.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Manages localStorage-backed cache for advanced contact lookup results with add, retrieve, and clear operations.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and exposes multiple AntiFraud canister actors and logs a readiness report once per session.",
  "frontend/src/hooks/useConsentGate.ts": "Tracks whether user consent is required or accepted using versioned localStorage state.",
  "frontend/src/hooks/useInternationalContactLookup.ts": "Performs international contact lookups via actor, returning structured details or a fallback when no data exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, creating AuthClient instances and exposing identity, login, logout, and status flags via React context.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline state and returns isOnline and isOffline flags.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder hook file for PWA install logic.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder hook file for PWA install prompt cooldown logic.",
  "frontend/src/hooks/useSubmitLookupReport.ts": "Submits lookup reports to a backend canister, managing loading, error, and success states with localization support.",
  "frontend/src/hooks/useUserProfile.ts": "Loads, updates, and clears per-identity user history from local storage using Internet Identity.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation selection, and persistence via React context.",
  "frontend/src/i18n/translations.ts": "Stores all application translation strings, primarily Portuguese, mapped by language code.",
  "frontend/src/ic/actors.ts": "Creates IC agents and typed actors for main, extra, and reports canisters using fixed canister IDs.",
  "frontend/src/ic/canisterIds.ts": "Defines and exports all canister IDs and a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid IDL and TypeScript interfaces for the extra canister’s phone and crypto report queries.",
  "frontend/src/ic/idl/main.idl.ts": "Defines Candid IDL and TypeScript interface for the main canister’s analyzeText method.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines Candid IDL and interfaces for submitting reports and performing email, phone, message, and crypto lookups.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report showing canister IDs and actor availability/method support.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive CSS variables for light and dark themes plus accessibility and mobile touch adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders a documentation overview page with localized text and a PDF generation button using generateDocumentationPdf.",
  "frontend/src/pages/HomePage.tsx": "Provides the main fraud‑analysis interface with tabs for message, email, phone, and crypto checks using structured analysis utilities.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an explanation of verification methods and scoring using localized content and SEO setup.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/InternationalContactSearchPage.tsx": "Implements an international contact search form with validation, backend lookup, and localized UI.",
  "frontend/src/pages/MissionPage.tsx": "Shows the mission, vision, values, and social impact sections with localized text and SEO configuration.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the privacy policy page using i18n content and SEO setup, with multiple dynamic sections inside cards.",
  "frontend/src/pages/TermsPage.tsx": "Renders the terms and conditions page with i18n‑based content, SEO initialization, and sectioned card layout.",
  "frontend/src/pwa/install.ts": "Implements PWA install prompt handling by capturing the beforeinstallprompt event and exposing a trigger function.",
  "frontend/src/router/useSimpleRouter.ts": "Provides a minimal custom router using shared state, history API navigation, and listeners for route updates.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Contains normalization helpers and keyword/phrase matching utilities for antifraud text analysis.",
  "frontend/src/utils/contactInputHeuristics.ts": "Provides heuristics to detect, normalize, and validate phone or email inputs with multilingual error messages.",
  "frontend/src/utils/documentationContent.ts": "Builds a structured documentation object combining static content with Portuguese translations for institutional pages.",
  "frontend/src/utils/emailHeuristics.ts": "Analyzes email strings for scam‑like patterns and flags risky addresses using deterministic heuristics.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Generates a downloadable text‑based documentation file by assembling structured content into a formatted string.",
  "frontend/src/utils/highRiskPhrases.ts": "Defines high- and medium‑risk fraud phrase patterns with fragments, categories, and weights.",
  "frontend/src/utils/localRateLimit.ts": "Implements a localStorage‑based cooldown to rate‑limit user submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Provides a heuristic message analyzer that scores scam likelihood using keywords, crypto patterns, URLs, and formatting signals.",
  "frontend/src/utils/publicContactLookup.ts": "Loads a same‑origin dataset and looks up public contact information for phones or emails.",
  "frontend/src/utils/publicSourceProviders.ts": "Aggregates public‑source presence checks using the local dataset and future external providers.",
  "frontend/src/utils/riskScoring.ts": "Computes deterministic 0–100 fraud risk scores from weighted factors and maps scores to risk levels.",
  "frontend/src/utils/riskWeights.ts": "Defines default risk‑scoring weights and thresholds and exports a shared configuration object.",
  "frontend/src/utils/seo.ts": "Sets page title and meta description at runtime for consistent SEO branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Runs structured heuristic fraud analysis using phrase patterns, normalized text, scoring, and language templates to produce risk results.",
  "frontend/src/utils/translateBackendResult.ts": "Translates Portuguese backend analysis text to other languages using a simple dictionary lookup.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash without reloading the page.",
  "frontend/src/utils/userProfileStorage.ts": "Manages per‑user profiles in localStorage, storing query history and preferences with load, save, and clear helpers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and layout settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements, architectural notes, known issues, and feature definitions for the international contact lookup module."
}