{
  "backend/main.mo": "Implements user profile storage with access control checks and exposes queries for profiles, roles, and read‑only phone/crypto report tables.",
  "feature_evidence.json": "Defines feature evidence entries listing related frontend files, components, test IDs, and descriptions for multiple Advanced Contact Lookup features.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files covering components, i18n, routing, PWA, and backend actor bindings.",
  "frontend/index.css": "Defines global Tailwind‑based OKLCH color variables and dark‑mode overrides for app-wide styling.",
  "frontend/index.html": "HTML entry point configuring metadata, icons, manifest, and bootstrapping the React application.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documents that Phase 3a adds a read‑only database canister requiring no frontend changes and outlines verification steps.",
  "frontend/PRODUCTION_BUILD_VERIFICATION.md": "Detailed checklist for validating the production build, covering routing, consent modal, branding, analysis features, offline caching, and reporting flow.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back to the app shell while displaying a simple redirect message.",
  "frontend/public/data/public-contact-lookup.json": "Static dataset providing example public lookup info for specific phone numbers and email addresses.",
  "frontend/public/manifest.webmanifest": "Defines PWA settings, metadata, and icons for the AntiFraud app.",
  "frontend/public/service-worker.js": "Implements a network-first caching service worker with precaching and offline fallback.",
  "frontend/PWA_WEBAPK_ANDROID_TEST.md": "Step‑by‑step instructions for verifying WebAPK installation behavior on Android Chrome and determining whether installation succeeds as a real app.",
  "frontend/src/App.tsx": "Main app component handling routing, consent gate, PWA setup, and service worker registration.",
  "frontend/src/backend.idl.ts": "IDL definition exposing a single analyzeText text-processing canister method.",
  "frontend/src/components/AdvancedContactLookup.tsx": "Component for validating and analyzing phone/email inputs with public lookup and offline caching.",
  "frontend/src/components/AdvancedContactLookupResultCard.tsx": "Displays antifraud results, public info, and reporting options for a contact lookup.",
  "frontend/src/components/AppLayout.tsx": "Provides the main UI layout with navigation, header, responsive menu, and language/auth controls.",
  "frontend/src/components/AuthControl.tsx": "Manages login/logout via Internet Identity and shows user profile menu when authenticated.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Shows community risk scores, categories, and counts for collaborative fraud reports.",
  "frontend/src/components/ConsentGateModal.tsx": "Modal requiring users to accept cookies and terms before continuing, with links to terms and privacy pages and enforced confirmation checks.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty file with no implemented content.",
  "frontend/src/components/InstallButton.tsx": "Button that triggers PWA installation and alerts the user if installation isn't eligible.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown for choosing the UI language from a predefined list, updating the app's current language.",
  "frontend/src/components/PwaInstallAction.tsx": "Small button that runs the PWA install trigger without eligibility warnings.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Dialog for anonymously submitting spam/phishing/scam reports with category selection and optional description.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Card displaying a structured fraud analysis result including risk level, explanation, recommendation, sources, and collaborative basis.",
  "frontend/src/components/UserProfileMenu.tsx": "User profile panel showing principal ID, lookup history with clear option, and a logout button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdvancedContactLookupCache.ts": "Hook managing localStorage-backed caching of contact lookup results with add, get, and clear functions.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and manages IC canister actors using the user's identity, handling readiness logging and error recovery.",
  "frontend/src/hooks/useConsentGate.ts": "Manages a localStorage-based consent gate that requires users to accept terms before proceeding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication via Internet Identity, exposing identity state, login, and logout through React context.",
  "frontend/src/hooks/useOfflineStatus.ts": "Tracks browser online/offline status and exposes simple flags.",
  "frontend/src/hooks/usePwaInstall.ts": "Empty placeholder hook.",
  "frontend/src/hooks/usePwaInstallPromptCooldown.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useSubmitLookupReport.ts": "Submits anonymous lookup reports locally with simulated delay and error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and manages per-identity user history stored in localStorage.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state and translations through React context with sessionStorage persistence.",
  "frontend/src/i18n/translations.ts": "Contains Portuguese translation strings for the UI, including navigation and feature texts.",
  "frontend/src/ic/actors.ts": "Creates HttpAgent instances and typed actors for main, extra, and reports canisters.",
  "frontend/src/ic/canisterIds.ts": "Defines and exposes fixed canister IDs for the app's IC services.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines Candid interface for the extra canister, exposing phone and crypto report queries.",
  "frontend/src/ic/idl/main.idl.ts": "Defines Candid interface for the main canister with a text analysis method.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines Candid interface for the reports canister, supporting report submission and lookup queries.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report showing available canisters and method support for main, extra, and reports actors.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes, accessibility, and mobile touch targets.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/DocumentationPage.tsx": "Renders a documentation overview page with i18n text, SEO setup, and a button to generate a PDF.",
  "frontend/src/pages/HomePage.tsx": "Provides the main fraud‑analysis UI with tabs for message, email, phone, and crypto checks using structured analysis utilities.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an accordion‑based explanation of verification methods with SEO setup and i18n content.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder file for an institutional mission page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder file for an institutional page.",
  "frontend/src/pages/MissionPage.tsx": "Shows the mission, vision, values, and limitations of the platform using i18n text with SEO setup and defensive rendering.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the privacy policy page with localized text, SEO metadata, and multiple content sections using defensive paragraph rendering.",
  "frontend/src/pages/TermsPage.tsx": "Renders the terms and conditions page with localized text, SEO metadata, and sectioned content using a paragraph rendering helper.",
  "frontend/src/pwa/install.ts": "Manages PWA installation prompts by capturing the deferred install event and exposing a trigger function.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a lightweight client-side router using history API, shared state, and custom navigation events.",
  "frontend/src/utils/antifraudTextNormalize.ts": "Provides text normalization utilities and keyword-matching helpers for accent-insensitive antifraud checks.",
  "frontend/src/utils/contactInputHeuristics.ts": "Detects, normalizes, and validates phone or email input with basic heuristics and multilingual error messages.",
  "frontend/src/utils/documentationContent.ts": "Generates a full documentation structure combining static text with Portuguese translations for institutional pages.",
  "frontend/src/utils/emailHeuristics.ts": "Analyzes emails with deterministic heuristics to flag suspicious domains, patterns, or formats.",
  "frontend/src/utils/generateDocumentationPdf.ts": "Builds a text-based documentation file from structured content and triggers a client-side download.",
  "frontend/src/utils/localRateLimit.ts": "Implements a 1‑minute local cooldown using localStorage to limit repeated submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Performs heuristic scam scoring on messages using keywords, crypto patterns, URLs, and punctuation to assign a risk level.",
  "frontend/src/utils/publicContactLookup.ts": "Loads a local JSON dataset and looks up public contact metadata for phones or emails.",
  "frontend/src/utils/seo.ts": "Sets dynamic document titles and meta descriptions with AntiFraud branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Provides structured fraud‑risk evaluation with templates, indicators, and localized explanations.",
  "frontend/src/utils/translateBackendResult.ts": "Translates backend‑generated Portuguese scam analysis text into other languages using a dictionary.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters across navigation and hash-based routing.",
  "frontend/src/utils/userProfileStorage.ts": "Stores, retrieves, and clears per-user history and preferences in localStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, content scanning, extended theming (colors, typography, animations), and plugin setup.",
  "project_state.json": "JSON metadata describing project state, architectural notes, known issues, and PWA installation flow requirements for the AntiFraud LIVE app."
}