{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and read-only phone/crypto report lookup tables.",
  "feature_evidence.json": "Feature evidence manifest listing feature IDs, affected files, components, and test references for multiple frontend requirements.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line descriptions of all major frontend files.",
  "frontend/index.css": "Tailwind base styling defining OKLCH color tokens and dark mode variables with global layout rules.",
  "frontend/index.html": "Entry HTML page loading the React app with AntiFraud branding, manifest, icons, and main script.",
  "frontend/PHASE3A_READONLY_FRONTEND_NOCHANGE.md": "Documentation stating Phase 3a introduces a read‑only canister and requires no frontend changes.",
  "frontend/public/404.html": "SPA fallback page that redirects known routes back into the app shell.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and icon assets.",
  "frontend/public/service-worker.js": "Service worker implementing caching, route fallbacks, and network‑first fetch handling.",
  "frontend/src/App.tsx": "Root React component setting document title, routing logic, and global providers for identity, i18n, and queries.",
  "frontend/src/backend.idl.ts": "Candid IDL factory exposing only the analyzeText method for the backend canister.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with header, navigation, language selector, auth control, and mobile menu handling.",
  "frontend/src/components/AuthControl.tsx": "Shows login button or user profile menu based on Internet Identity authentication state.",
  "frontend/src/components/CollaborativeResultCard.tsx": "Displays collaborative lookup results including risk score, report count, categories, and status messages.",
  "frontend/src/components/DashboardQuickActions.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown to switch the app language using available language options.",
  "frontend/src/components/PwaInstallAction.tsx": "Handles PWA installation flow, showing install button or manual install instructions depending on platform and installability.",
  "frontend/src/components/ReportSubmissionDialog.tsx": "Implements a full report submission form with validation, rate limiting, and structured report payload handling.",
  "frontend/src/components/StructuredAnalysisResultCard.tsx": "Displays structured fraud‑analysis results including risk level, explanation, and recommendation.",
  "frontend/src/components/UserProfileMenu.tsx": "Shows user identity info, lookup history with management actions, and a logout button.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAntiFraudActors.ts": "Initializes and stores main, extra, and reports actors using the user’s identity and logs a readiness report once.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and identity management using Internet Identity with login, logout, and status tracking.",
  "frontend/src/hooks/usePwaInstall.ts": "Detects PWA installability, tracks platform and install status, and exposes a method to trigger installation prompts.",
  "frontend/src/hooks/useUserProfile.ts": "Loads, saves, and clears per-identity user history stored locally.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language selection and translation access using stored session preferences.",
  "frontend/src/i18n/translations.ts": "Contains Portuguese UI translation strings for navigation, forms, actions, results, and errors.",
  "frontend/src/ic/actors.ts": "Creates agents and typed actors for the main, extra, and reports canisters on IC mainnet.",
  "frontend/src/ic/canisterIds.ts": "Defines and exports fixed canister IDs and a helper to retrieve them by type.",
  "frontend/src/ic/idl/extra.idl.ts": "Defines the Candid interface and TypeScript types for phone and crypto report queries.",
  "frontend/src/ic/idl/main.idl.ts": "Defines the Candid interface for the main canister’s text analysis function.",
  "frontend/src/ic/idl/reports.idl.ts": "Defines the Candid interface and types for submitting reports and querying collaborative lookup data.",
  "frontend/src/ic/readinessReport.ts": "Generates and logs a readiness report indicating available canister actors and supported methods.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables including light/dark color schemes and accessibility tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Provides the main UI for analyzing messages, emails, phone numbers, and crypto addresses with tabbed inputs and results.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays accordion-based explanations of verification methods with SEO setup and translated content.",
  "frontend/src/pages/InstitutionalMissionPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/InstitutionalPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/MissionPage.tsx": "Shows mission-related sections with icons and translated paragraphs, including vision, core mission, impact, values, and limitations.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders a privacy policy page using translated sections and sets SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with localized text, SEO metadata, and defensive paragraph rendering.",
  "frontend/src/router/useSimpleRouter.ts": "Implements a lightweight client-side router hook using history state and custom navigation events.",
  "frontend/src/utils/emailHeuristics.ts": "Provides deterministic email risk analysis using domain, TLD, pattern, and formatting heuristics.",
  "frontend/src/utils/localRateLimit.ts": "Implements a simple localStorage-based cooldown to limit repeated submissions.",
  "frontend/src/utils/messageHeuristics.ts": "Analyzes messages for scam indicators using keyword weights, crypto patterns, URLs, and formatting heuristics.",
  "frontend/src/utils/seo.ts": "Sets document title and meta description for SPA routes with branding.",
  "frontend/src/utils/structuredFraudAnalysis.ts": "Generates structured fraud‑risk results using heuristic indicators and localized explanation templates.",
  "frontend/src/utils/translateBackendResult.ts": "Performs dictionary-based translation of backend analysis text into the selected language.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/src/utils/userProfileStorage.ts": "Manages per‑user profiles in localStorage, storing history items and optional language preferences.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining content paths, theme extensions, custom colors, typography, animations, and plugins.",
  "project_state.json": "Describes the project’s current state, architectural decisions, constraints, known issues, and official content requirements."
}