{
  "kind": "build_request",
  "title": "Add ES/FR/DE i18n with PT fallback, expand language dropdown, and update responsive footer references",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand the internationalization system to support Spanish (ES), French (FR), and German (DE) while guaranteeing a safe fallback to Portuguese (PT) for any missing translation key.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Restaurar e criar os idiomas ES, FR, DE com fallback seguro para Português"
        ]
      },
      "acceptanceCriteria": [
        "The app recognizes five language codes: pt, en, es, fr, de.",
        "If a translation key is missing in the active language, the Portuguese value is shown instead of rendering undefined/blank.",
        "Switching languages does not change routing, app layout structure, or build configuration.",
        "No backend/canister changes are introduced."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the language dropdown so it always lists exactly these five options: PT, EN, ES, FR, DE (including appropriate native language names), and selecting an option updates the UI language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Garantir dropdown com PT, EN, ES, FR, DE"
        ]
      },
      "acceptanceCriteria": [
        "The language selector dropdown displays five options: PT, EN, ES, FR, DE.",
        "The currently selected language is reflected in the dropdown trigger (desktop shows native name; mobile shows the 2-letter code).",
        "Selecting ES/FR/DE works without runtime errors even if translations are placeholders."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the footer to include a professional references line with clickable official links to ENISA, CISA, CNCS, and Europol, while preserving the existing credit 'by HCoragem' and the Internet Computer credit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Rodapé atualizado com referências públicas legais (ENISA, CISA, CNCS, Europol), links clicáveis"
        ]
      },
      "acceptanceCriteria": [
        "Footer still shows the existing 'by HCoragem' credit.",
        "Footer still contains the existing Internet Computer/ICP reference section already present in the UI.",
        "Footer includes the exact text line (localized or in English if not localized yet): 'References public cybersecurity advisories from:' followed by ENISA (EU), CISA (USA), CNCS (PT), Europol (EU) as clickable links to: https://www.enisa.europa.eu/, https://www.cisa.gov/, https://www.cncs.gov.pt/, https://www.europol.europa.eu/.",
        "No certification/audit badges or official certification seals are added (text links only)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the updated language selector and footer layout remain fully responsive on mobile and desktop, and ensure any images/icons used by these UI elements are served from the frontend public /assets/ path.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Layout totalmente responsivo, imagens em /assets/"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the footer content wraps/aligns without overflow or overlapping elements.",
        "On desktop screens, footer content remains readable and properly spaced.",
        "Any images/icons referenced by these components resolve under /assets/ (including existing /assets subfolders) and render crisply at 16x16px when used as small icons."
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend (no Motoko changes, no canister changes).",
    "Do not perform a structural rebuild of the app (no routing, root, or build config refactors).",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT; only compose/use them.",
    "Use English for any new user-facing text added as part of this change unless it is managed via translations."
  ],
  "nonGoals": [
    "Providing fully translated ES/FR/DE copy across the entire app (placeholders are acceptable for this step).",
    "Adding new pages, new navigation routes, or new backend APIs.",
    "Adding certification logos or claims of certification in the footer."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}