{
  "kind": "build_request",
  "title": "Incremental AntiFraud message dictionary scoring + public phone LOW override (logic-only patch)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the existing message-text analysis logic to include an internal `risk_dictionary` object with `severity=\"critical\"` and `risk_level=\"maximum\"`, containing the provided keyword/phrase groups, and apply it ONLY when analyzing message text (not phone, email, crypto, or public-entity lookups).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Extend the existing message analysis module by adding a risk_dictionary with severity=\"critical\" and risk_level=\"maximum\". This dictionary must affect ONLY message text analysis.",
          "Do not alter scoring behavior for phone, crypto, email or public entity lookups."
        ]
      },
      "acceptanceCriteria": [
        "A `risk_dictionary` exists in the message analysis module with fields `severity: \"critical\"` and `risk_level: \"maximum\"` and includes all keywords/phrases provided in the request (grouped as given).",
        "Dictionary matching is applied only for message text analysis paths; phone/email/crypto analysis results remain unchanged for the same inputs compared to pre-patch behavior.",
        "No persistence is added for analyzed message content; analysis remains in-memory only.",
        "Backend API surface (existing methods/types) remains unchanged; only internal message analysis logic is updated."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement cumulative scoring for the `risk_dictionary` in message-text analysis: each matched keyword/phrase occurrence increases the message risk score, and multiple matches increase the score cumulatively; cap/clamp the final message risk score to the existing scoring range (e.g., 0–100) without changing non-message scoring behaviors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Each listed keyword increases risk score. Multiple keywords increase score cumulatively."
        ]
      },
      "acceptanceCriteria": [
        "For message text analysis, adding more distinct dictionary keywords/phrases to the input increases the computed risk score monotonically (cumulative effect).",
        "Repeated occurrences of a listed keyword/phrase increase the score cumulatively (occurrence-based), per the request.",
        "Final message risk score remains within the existing score bounds used by the app (no overflow), and message risk level mapping continues to function."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enforce the Public Phone Rule override in the phone search flow: when a searched phone number is identified as a public/official entity, always display entity name and country, and always force risk level to LOW with risk score shown as 0%, regardless of any other heuristics/dictionary scoring; this override must not affect non-public phone results, and must not affect message analysis.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When a searched phone number is identified as a public or official entity: Always display entity name and country. Always display risk level = 0% (LOW). Never escalate public official numbers to high or critical. This rule overrides dictionary logic."
        ]
      },
      "acceptanceCriteria": [
        "When `public/official entity` detection is true for a phone lookup, the UI shows the entity name and country and shows risk as LOW with score 0/100 (0%).",
        "For the same public/official phone lookup, risk is never displayed as Medium/High/Critical, even if other risk signals (e.g., reports, heuristics) would otherwise elevate it.",
        "Non-public phone lookups display risk exactly as before this patch.",
        "Message analysis risk behavior is unaffected by this phone override (separate code paths)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply the update as a small incremental logic-only patch: do not recreate pages, do not change existing layout/UI structure, do not modify seals/research modules/crypto search/email analysis/phone search flows beyond the specific public-phone LOW override above; do not add persistence; do not change backend storage/schema/auth; and ensure the string \"Caffeine\" is not introduced anywhere in user-facing text, metadata, or visible code as part of this patch.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Apply incremental logic update only. Do NOT rebuild the application. Do NOT recreate pages. Do NOT modify existing layout, seals, research modules, crypto search, email analysis or phone search.",
          "No persistence. No backend structure changes. No authentication changes. Logic patch only.",
          "Do not include the name “Caffeine” anywhere in the application, footer, metadata or visible code."
        ]
      },
      "acceptanceCriteria": [
        "No new routes/pages/layout components are added or recreated as part of this change; only the targeted analysis logic is modified.",
        "No new backend stable variables/tables are added; no schema/state migrations are introduced.",
        "No authentication/Internet Identity-related code is changed.",
        "A repository-wide check confirms the patch did not introduce the literal string \"Caffeine\" in frontend user-facing text, HTML metadata, or source code comments/identifiers intended to be visible."
      ]
    }
  ],
  "constraints": [
    "Do not rebuild or recreate the application/pages; apply an incremental logic-only patch.",
    "Do not modify existing layout, seals, research modules, crypto search, email analysis, or phone search behavior except the explicit public-phone LOW override rule.",
    "No persistence and no backend structure/schema changes; no authentication changes.",
    "The risk_dictionary must affect ONLY message text analysis.",
    "Public/official phone numbers must always display entity name and country and must always remain LOW at 0% risk, overriding other logic.",
    "Do not include the name “Caffeine” anywhere in the application, footer, metadata, or visible code.",
    "Use English for any user-facing text introduced or modified by this patch."
  ],
  "nonGoals": [
    "Adding new UI pages (including /antifraud) or changing existing navigation/layout.",
    "Changing scoring thresholds/weights for email/phone/crypto lookups (other than forcing public phones to 0% LOW).",
    "Adding databases, persistence, or storing analyzed message content.",
    "Introducing new authentication or identity flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}