{
  "kind": "build_request",
  "title": "Restart live integration: Advanced Contact Lookup + Anonymous Reporting (with PWA offline support and i18n)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-46",
      "text": "Integrate an in-context “Report suspicious contact” action into the Advanced Contact Lookup results panel so users can submit an anonymous, legally-safe report for the searched phone/email, using the existing report submission dialog flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "Botão de denúncia\nPermite ao utilizador denunciar contactos suspeitos.\nGarantia de anonimato e legalidade.\nTags opcionais: Spam, Phishing, Golpe, Outro."
        ]
      },
      "acceptanceCriteria": [
        "When a user completes an Advanced Contact Lookup search, the results area provides a clear “Report suspicious contact” action.",
        "Clicking the action opens a dialog that is prefilled with the searched contact value and the correct report type (phone or email).",
        "The reporting flow does not require the user to authenticate and does not display or request any personally identifying information beyond the reported contact itself.",
        "The dialog includes a short, user-facing anonymity/legal notice (English text in the EN locale; localized equivalents in other supported languages) stating that reports are anonymous and should only include public/non-sensitive information.",
        "Submitting the report shows a clear success state and closes/reset the dialog after success (consistent with existing dialog behavior)."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Restrict the report “tag/category” choices shown for Advanced Contact Lookup reporting to exactly: Spam, Phishing, Scam, Other, while preserving the underlying compatibility with existing report category types.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "Tags opcionais: Spam, Phishing, Golpe, Outro."
        ]
      },
      "acceptanceCriteria": [
        "In the Advanced Contact Lookup reporting dialog, the selectable tag/category list shown to the user is limited to: Spam, Phishing, Scam, Other.",
        "The selected tag is submitted using the existing report category model (mapping to existing categories where applicable).",
        "If the user does not select a tag, the submission still works by defaulting to “Other” (or an equivalent safe default), without blocking submission."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Ensure Advanced Contact Lookup results remain available offline on a best-effort basis by leveraging the existing local cache and service worker caching behavior, without breaking PWA installability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "PWA / WebAPK\nService worker cacheando resultados (offline parcial)."
        ]
      },
      "acceptanceCriteria": [
        "When offline, previously searched contacts that exist in the local cache can still be displayed in the Advanced Contact Lookup results UI.",
        "The service worker precache includes the public lookup dataset (`/data/public-contact-lookup.json`) and continues to use a network-first strategy with cache fallback for same-origin requests, without introducing install prompt regressions.",
        "No new service worker console errors are introduced in production mode.",
        "PWA install CTA remains functional after these changes."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Add/verify multilingual i18n coverage for all user-facing text introduced or changed by the Advanced Contact Lookup reporting flow across PT/EN/ES/FR/ZH/AR/RU, and ensure English is used for EN user-facing strings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "Traduções multilíngues\nEN/ES/FR/ZH/AR/RU aplicadas em todos os textos e botões."
        ]
      },
      "acceptanceCriteria": [
        "All new labels/buttons/help text related to reporting-from-lookup render via the existing i18n system (no hardcoded strings in components).",
        "EN locale strings are written in English.",
        "No missing-key placeholders (undefined/fallback fragments) appear in any supported language for the reporting-from-lookup flow."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Update the production verification checklist to include explicit test steps for Advanced Contact Lookup (phone/email) and the anonymous reporting flow (including tag selection), alongside existing antifraud engine, consent gate, and PWA/WebAPK checks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "Testes finais integrados\nPesquisa de contactos públicos validada.\nDenúncias testadas.\nMotor antifraude, PWA/WebAPK e consentimento confirmados."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/PRODUCTION_BUILD_VERIFICATION.md` includes a new checklist subsection covering: (1) Advanced Contact Lookup search behavior, (2) offline cached lookup behavior, and (3) submitting a report from lookup results with tags Spam/Phishing/Scam/Other.",
        "Checklist steps are concrete and repeatable (what to click/type, expected UI states)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend immutablePaths (e.g., `frontend/src/main.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/components/ui/*`).",
    "Preserve existing AntiFraud / by HCoragem branding and avoid unintended visual/layout changes outside the Advanced Contact Lookup + reporting surfaces.",
    "Keep antifraud risk evaluation for contact lookup 100% frontend (no new backend/canister calls for analysis logic).",
    "Respect the current PWA install flow implementation (`setupPWAInstall()` / `triggerPWAInstall()`) and do not add alternative install prompt logic.",
    "Backend remains single-actor; do not introduce new backend services or databases."
  ],
  "nonGoals": [
    "Building or distributing native Android/iOS apps (App Store / Google Play).",
    "Adding third-party auth providers beyond Internet Identity.",
    "Implementing real-time features (WebSockets/chat/push notifications).",
    "Expanding report categories beyond the four user-requested tags for the Advanced Contact Lookup reporting UX."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}