{
  "kind": "build_request",
  "title": "Add advanced contact lookup module (phone/email) with antifraud integration, public-source metadata, offline caching, and multilingual UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Implement a production-ready “Advanced Contact Lookup” module in the frontend that accepts either a phone number or an email address in a single input, performs basic validation, and runs a lookup when the user presses a dedicated “Search” button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "Confirmo — podes gerar o código completo do módulo avançado de pesquisa de contactos para integração imediata no projeto.\nSegue exatamente os requisitos: pesquisa de telefone/email, integração com motor antifraude, retorno de informações públicas com fonte e data, compatível com PWA/WebAPK e traduções multilíngues."
        ]
      },
      "acceptanceCriteria": [
        "A new UI module exists in the app that provides one input that accepts either phone or email and a single “Search” action.",
        "The module rejects empty input and displays a localized validation error.",
        "The module detects whether the input is phone vs email (based on basic heuristics/format checks) and proceeds accordingly.",
        "The module does not require Internet Identity login to be used (same accessibility level as existing Home analysis tabs)."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Integrate the Advanced Contact Lookup results with the existing 100% frontend antifraud engine so each searched contact returns a structured risk outcome (Low/Medium/High) plus a user-readable description/explanation and recommendation in the currently selected UI language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "integração com motor antifraude"
        ]
      },
      "acceptanceCriteria": [
        "For phone searches, the module computes risk using the existing frontend-only antifraud logic (no new backend calls for the antifraud analysis).",
        "For email searches, the module computes risk using the existing frontend-only antifraud logic (no new backend calls for the antifraud analysis).",
        "The risk level and explanation/recommendation render in the same results panel as the public lookup information.",
        "Risk output follows the app’s existing structured results conventions (Low/Medium/High and localized text)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Implement a public-information lookup layer for phone/email that returns only legally safe, non-sensitive, publicly presented information and always includes (a) source name, (b) source URL (when applicable), and (c) “as of” date for the returned information.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "Retorno de informações públicas com fonte e data",
          "Consulta a fontes públicas gratuitas\nAPI/serviço mock ou gratuito para informações legais e públicas sobre números/email.\nGarantia de legalidade total e indicação de fonte e data."
        ]
      },
      "acceptanceCriteria": [
        "Search results include a “Public information” section with at least: display name (only when available), summary/details text, source, and date.",
        "If no public info is found, the UI shows a localized “No public information found” state while still showing antifraud analysis results.",
        "All returned public info is explicitly presented as public-source information with clear attribution (source + date) visible to the user.",
        "The implementation does not require any new external paid services, API keys, or third-party authentication providers."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Make the Advanced Contact Lookup module compatible with PWA/WebAPK usage by enabling offline partial behavior: the module’s static resources and any same-origin lookup resources must be cacheable, and previously viewed lookup results should remain available when offline (best-effort).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "PWA e offline\nResultados cacheáveis no service worker (offline parcial).\nCompatível com WebAPK e instalação nativa."
        ]
      },
      "acceptanceCriteria": [
        "When the app is installed as a PWA and the device is offline, the Advanced Contact Lookup UI still loads (app shell works) and the module does not crash.",
        "Previously viewed lookup results are available offline (best-effort), with a localized indicator if the app is offline and cannot refresh data.",
        "`frontend/public/service-worker.js` continues to use a network-first strategy for general requests and does not regress installability/WebAPK behavior.",
        "Offline behavior does not introduce new backend dependencies."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add full multilingual support for all new Advanced Contact Lookup UI text across PT/EN/ES/FR/ZH/AR/RU using the existing i18n system; do not hardcode user-facing strings in components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "traduções multilíngues"
        ]
      },
      "acceptanceCriteria": [
        "All new labels/buttons/errors/empty-states in the Advanced Contact Lookup module are sourced from the i18n dictionary.",
        "The module displays correct translations for PT/EN/ES/FR/ZH/AR/RU when switching languages via the existing language selector.",
        "No new Advanced Contact Lookup user-facing strings are left hardcoded in Portuguese or English inside React components."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Integrate the Advanced Contact Lookup module into the existing app navigation/UI so it is immediately usable in production without disrupting existing Home page verification tabs and without modifying any immutable frontend paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-advanced-contact-search"
        ],
        "quotes": [
          "para integração imediata no projeto"
        ]
      },
      "acceptanceCriteria": [
        "The module is reachable from the current UI (e.g., as a new Home tab or a dedicated section) without breaking existing Message/Email/Phone/Crypto tabs.",
        "Existing Home page functionality (analysis tabs, results rendering, install button, consent gate) continues to work unchanged.",
        "No files under `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui` are modified."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Do not introduce non-supported technologies (no external databases, no WebSockets, no third-party auth providers).",
    "Keep antifraud analysis for this module frontend-only (no new canister calls for analysis).",
    "Preserve existing PWA/WebAPK installability behavior; any service worker changes must not regress installation prompting or caching of the app shell."
  ],
  "nonGoals": [
    "Building native Android/iOS apps or preparing App Store / Play Store submissions.",
    "Adding paid/subscription features, push notifications, SMS/WhatsApp integrations, or real-time messaging.",
    "Introducing new backend canisters or external databases to store lookup results.",
    "Guaranteeing the accuracy or completeness of public contact information beyond what the cited sources provide."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}