{
  "kind": "build_request",
  "title": "Targeted visible fixes: PWA install behavior, mandatory consent modal, and page layout polish (no full rebuild)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix PWA behavior so the app is clearly installable as a real standalone PWA (not just a shortcut) by ensuring the service worker is registered at runtime, becomes the controlling service worker for the page, and the install CTA reliably triggers the captured `beforeinstallprompt` flow when available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Avançar apenas com correção visível de PWA, modal obrigatória e layout das páginas. Sem rebuild total"
        ]
      },
      "acceptanceCriteria": [
        "On first load in a supported browser, the app registers `public/service-worker.js` and `navigator.serviceWorker.controller` becomes non-null after activation/refresh (i.e., the service worker controls the page).",
        "When `beforeinstallprompt` is available, the existing install CTA (from `PwaInstallAction`) triggers the native install prompt via the stored deferred prompt event (no link-like fallback behavior while install is actually available).",
        "PWA behavior remains compatible with the existing manifest at `frontend/public/manifest.webmanifest` and the existing service worker routes/caching logic in `frontend/public/service-worker.js` (no breaking changes to offline navigation fallback)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the consent gate modal strictly non-dismissible until the user accepts all required consents (cookies + terms + privacy), including preventing dismissal via ESC, outside click, and any other dialog-close interactions; acceptance must remain persisted via the existing localStorage consent state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Avançar apenas com correção visível de PWA, modal obrigatória e layout das páginas. Sem rebuild total"
        ]
      },
      "acceptanceCriteria": [
        "While consent is required, the modal cannot be closed by pressing ESC, clicking outside the dialog, or any overlay interaction; only the explicit accept action (enabled after all checkboxes are checked) can remove the gate.",
        "After acceptance, consent is persisted using the existing storage key/versioning in `frontend/src/hooks/useConsentGate.ts`, and the modal does not reappear on refresh unless the consent version is bumped.",
        "The app remains blocked from use while consent is required (no interaction with core app UI)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust page layout styling (targeted UI/layout corrections only) to improve spacing rhythm, visual hierarchy, and readability across the main pages (Home, Mission, How It Works, Terms, Privacy) without rewriting or changing the existing content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Avançar apenas com correção visível de PWA, modal obrigatória e layout das páginas. Sem rebuild total"
        ]
      },
      "acceptanceCriteria": [
        "Institutional pages using `InstitutionalPageLayout` have consistent section spacing and mobile-friendly typography (no cramped separators or uneven vertical rhythm).",
        "The Home page layout remains centered and readable across mobile and desktop with consistent container spacing relative to the sticky header and footer.",
        "No changes are made to antifraud analysis logic or the textual content itself; changes are limited to layout/styling/composition."
      ]
    }
  ],
  "constraints": [
    "Do not perform a full rebuild or large refactor; implement only targeted, visible fixes for PWA behavior, mandatory consent modal gating, and page layout.",
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui/*`.",
    "Do not modify antifraud detection/analysis logic; this pass is UI/PWA/compliance-gate refinement only.",
    "Backend changes are out of scope unless strictly required for these visible frontend fixes (default: no backend changes)."
  ],
  "nonGoals": [
    "Adding new antifraud features or changing analysis algorithms/results.",
    "Adding new authentication providers (Internet Identity only).",
    "Introducing new backend services, external databases, or real-time communication.",
    "Rewriting Terms/Privacy/Mission/How It Works content (styling/layout polish only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}