{
  "kind": "build_request",
  "title": "Finalize production build: consolidate PWA/WebAPK, complete i18n, and production verification checklist",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Consolidate the PWA production configuration by replacing the current temporary test manifest and service worker with the final production versions, while preserving the existing AntiFraud branding and icon paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Instrução explícita: Iniciar build final de produção. Vou executar a compilação completa, integrando todos os ajustes de código, manifest, service worker, motor antifraude, PWA/WebAPK, traduções, consentimento e branding, conforme definimos."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/public/manifest.webmanifest` is updated for production (no test-only description such as \"Teste PWA WebAPK AntiFraud\"), keeps `name`/`short_name` as AntiFraud, keeps the existing generated icon paths, and includes `id` plus `prefer_related_applications: false`.",
        "`frontend/public/service-worker.js` is updated for production (not the temporary `antifraud-test` cache), uses the consolidated production caching strategy required for stable installability (WebAPK where supported), and does not break normal navigation/routing.",
        "A production build served over HTTPS loads with the manifest detected by the browser and the service worker controlling the page (no registration errors in console in production mode)."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Replace the current temporary PWA install prompt capture implementation with the finalized production `setupPWAInstall()` / `triggerPWAInstall()` implementation, ensuring it captures `beforeinstallprompt`, clears state on `appinstalled`, and returns whether installation was accepted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Manifest e service worker consolidados na versão definitiva de produção.",
          "CTA de instalação com deferredPrompt.prompt() funcionando.",
          "Evento appinstalled capturado."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pwa/install.ts` no longer contains temporary debug/test-only behavior (e.g., `window.PWA_CAN_INSTALL` flags and console-only instrumentation intended for testing).",
        "Calling `setupPWAInstall()` once on app startup results in `beforeinstallprompt` being captured (via a module-level deferred prompt) when the app becomes installable.",
        "Clicking the install CTA triggers `deferredPrompt.prompt()` when available, and `triggerPWAInstall()` resolves to `true` only when the user accepts the prompt; the deferred prompt is cleared after `userChoice` and also on the `appinstalled` event."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Make the install CTA fully production-ready by removing hardcoded Portuguese strings from the install button and fallback alert, and wiring all install CTA user-facing text through i18n across all supported languages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Configurar PWA e CTA instalável corretamente em todos os idiomas.",
          "Traduções multilíngues aplicadas e verificadas."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/InstallButton.tsx` does not contain hardcoded Portuguese strings for the button label or alert message.",
        "The install button label uses the existing i18n key (`installPrimaryButton`) and renders correctly for PT/EN/ES/FR/ZH/AR/RU.",
        "If installation is not eligible, the fallback message is localized via a dedicated i18n key added for this purpose (English text present in the EN locale)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Complete and integrate the full multilingual translation set derived from the official Portuguese source for EN, ES, FR, ZH, AR, and RU, covering navigation, consent modal, PWA install UI, analysis results (including transparency sections), and all institutional page content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "todas as páginas institucionais com conteúdos PT verbatim + traduções EN/ES/FR/ZH/AR/RU.",
          "Confirmar que as traduções EN/ES/FR/ZH/AR/RU estão corretas."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/i18n/translations.ts` includes complete locale objects for `en`, `es`, `fr`, `zh`, `ar`, and `ru` (in addition to `pt`) with no missing keys used by the UI.",
        "Switching languages via the existing language selector updates all visible UI strings (navigation, home page, consent modal, install CTA, analysis results, transparency labels) without falling back to Portuguese or showing undefined/missing text.",
        "Institutional pages (`/mission`, `/how-it-works`, `/terms`, `/privacy`) render complete localized content for each supported language (not placeholders or truncated summaries)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Add a developer-facing production verification checklist/report document that makes the final build audit repeatable, covering critical flows: routes, consent gate, branding, antifraud engine (frontend-only), public contact lookup behavior, translations, and PWA/WebAPK installation validation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Revisar todos os fluxos críticos e gerar relatório de verificação.",
          "Relatório final de verificação de todos os módulos."
        ]
      },
      "acceptanceCriteria": [
        "A new markdown file (e.g., `frontend/PRODUCTION_BUILD_VERIFICATION.md`) exists and is written in English.",
        "The checklist includes explicit, step-by-step validation items for: SPA navigation/routes (including aliases and 404 fallback behavior), consent gate blocking behavior until accepted, global AntiFraud / by HCoragem branding presence, antifraud analysis for message/email/phone/crypto with transparency sections, multilingual smoke checks for PT/EN/ES/FR/ZH/AR/RU, and PWA install behavior (including a reference/link to the existing `frontend/PWA_WEBAPK_ANDROID_TEST.md` for the Android WebAPK validation flow).",
        "The document ends with a clear pass/fail sign-off section indicating whether the build is ready for live deployment."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep the backend as a single Motoko actor in `backend/main.mo`; only introduce `backend/migration.mo` if a state migration is strictly required (not expected for this request).",
    "Preserve existing AntiFraud branding and generated icon asset paths referenced by the manifest/service worker unless explicitly required for production correctness."
  ],
  "nonGoals": [
    "Build or publish native Android/iOS applications, app store submissions, signing/provisioning, or any Google Play / Apple App Store distribution work.",
    "Introduce new backend services, external databases, or third-party authentication providers beyond Internet Identity.",
    "Redesign unrelated UI/UX or add new product features beyond production consolidation, i18n completeness, and verification documentation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}