{
  "kind": "build_request",
  "title": "Step 4: Implement 100% frontend antifraud engine (deterministic heuristics + mandatory High-risk overrides)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Implement/complete a 100% frontend antifraud analysis engine for all Home page verification tabs (message, email, phone, crypto) using deterministic heuristics only, returning a structured result object with (risk: Low/Medium/High, explanation, recommendation) and without calling any backend/canister methods for these analyses.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-apply-step-4"
        ],
        "quotes": [
          "Aplicar Passo 4"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, running analyses for Message/Email/Phone/Crypto uses only frontend utility functions and does not perform any backend actor calls.",
        "Each analysis returns a consistent StructuredAnalysisResult with risk in {'Low','Medium','High'} and non-empty explanation/recommendation strings.",
        "The UI continues to render results via the existing StructuredAnalysisResultCard component with no regressions to navigation, consent gating, PWA install flow, or institutional pages."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add a mandatory High-risk override for critical scam keywords for message analysis in all supported UI languages (PT/EN/ES/FR/ZH/AR/RU): if any critical keyword is detected (case-insensitive, accent-insensitive where applicable), the risk must be forced to High regardless of other heuristic scores, and the explanation must clearly state that the High risk was triggered by critical keywords.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-apply-step-4"
        ],
        "quotes": [
          "Aplicar Passo 4"
        ]
      },
      "acceptanceCriteria": [
        "For each supported language, there is a defined set of critical keywords used for mandatory High-risk detection (not only Portuguese).",
        "If a message contains any critical keyword (including accented/unaccented variants where relevant), analyzeMessage returns risk === 'High' even if no other indicators are present.",
        "The returned explanation/recommendation are localized to the selected UI language, and the explanation mentions that the High risk was triggered by critical keywords (localized wording)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure all antifraud engine outputs are fully localized for PT/EN/ES/FR/ZH/AR/RU, including indicator labels (e.g., urgency language, credential requests, links detected) so that explanations read naturally in the selected language and do not mix languages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-apply-step-4"
        ],
        "quotes": [
          "Aplicar Passo 4"
        ]
      },
      "acceptanceCriteria": [
        "Switching the language selector changes the language of explanation and recommendation strings returned by all analyze* functions.",
        "Indicator phrases embedded inside explanations are localized (no Portuguese-only indicator strings when language is not PT).",
        "If an unsupported language code is encountered, outputs fall back to English consistently."
      ]
    }
  ],
  "constraints": [
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, Internet Identity hooks, frontend/src/components/ui).",
    "Keep the antifraud engine deterministic and fully frontend-only (no external APIs, no LLM calls, no WebSockets).",
    "Do not change the PWA install flow behavior, manifest, or service worker as part of Step 4.",
    "Do not change the consent gate flow or institutional/legal page content as part of Step 4."
  ],
  "nonGoals": [
    "Building native Android/iOS apps or preparing App Store / Google Play submissions.",
    "Adding real-time message/call monitoring, push notifications, or device integrations.",
    "Introducing new backend persistence, databases, or additional canisters/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}