{
  "kind": "build_request",
  "title": "Phase 1: Public Location Search via OpenStreetMap Nominatim (frontend-only, no layout/scoring changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a minimal, isolated frontend Search module that detects public-location keywords and runs OpenStreetMap Nominatim queries for public entities, without changing backend behavior, without restructuring the app, and without modifying the existing message scoring engine.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Extend Search module to support public location queries.",
          "Use OpenStreetMap Nominatim API for public-category queries.",
          "Frontend request only. No backend restructuring. No persistent storage."
        ]
      },
      "acceptanceCriteria": [
        "A new minimal, modular Search layer exists in the frontend codebase (isolated utility/hook/components as appropriate) and can be invoked from the current search/analysis flow without app restructuring.",
        "Public-location keyword detection is accent-insensitive and case-insensitive (e.g., “polícia”, “policia”, “POLICIA” match).",
        "The keyword list includes at minimum: hospital, police, fire station, bombeiros, polícia, emergência, government office.",
        "When a public-location keyword is detected, the module queries OpenStreetMap Nominatim using public categories: hospital, police, fire_station, government, emergency.",
        "No backend canister methods are added/changed; no persistence is introduced (no new backend storage; no required database-like layer).",
        "The existing scoring/heuristics for normal searches remains unchanged and continues to run for non-public-location queries."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Render public-location search results inside the existing results display area (reuse the current results container), matching the existing result format style and without introducing new layout panels or visual redesign.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Display results inside the existing results display area.",
          "Do NOT create new layout panels. Do NOT restructure UI.",
          "Reuse current results container. Render public-location results in the same format style.",
          "No visual redesign."
        ]
      },
      "acceptanceCriteria": [
        "Public-location results are displayed in the same existing results area currently used for analysis results (no new side panels, no new page sections).",
        "Each returned entity shows: Entity name, Category, City/Region, Phone number (if available).",
        "Result rendering is consistent with the current card/typography style used by the existing results container (no theme overhaul).",
        "If Nominatim returns no results or errors, the user sees an error/empty state in the same results area (no new UI regions)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "For all returned public entities from Nominatim public-location searches, override risk output to risk_score = 0 and risk_level = LOW, fully overriding heuristics for those entities only, while keeping normal scoring unchanged for normal searches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "All returned public entities must automatically: risk_score = 0 risk_level = LOW Override heuristics completely",
          "No scoring logic change for normal searches."
        ]
      },
      "acceptanceCriteria": [
        "Every public-location entity displayed includes (or is represented by) a risk score of 0 and a risk level of LOW.",
        "The override applies only to public-location search results sourced from Nominatim; it does not alter message/email/phone/crypto scoring logic for other flows.",
        "No changes are made to the existing message scoring engine logic (e.g., no edits that change scoring behavior for message analysis)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Remove platform references from the application footer and metadata (HTML head/SEO helpers/manifest) so no platform branding or links appear in the footer or metadata.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "No platform references anywhere in footer or metadata."
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer includes platform branding/link elements (e.g., remove the external platform link and related icon/text currently present).",
        "No platform references are introduced into index.html metadata, runtime SEO title/description generation, or the web manifest.",
        "All remaining user-facing strings introduced/modified by this Phase 1 implementation are in English."
      ]
    }
  ],
  "constraints": [
    "Do not rebuild the entire application; implement Phase 1 as a minimal modular extension.",
    "Do not modify the message scoring engine logic.",
    "Do not modify the existing layout or restructure the UI; reuse the current results container.",
    "Frontend-only change for public-location search (no backend restructuring, no new persistence).",
    "No GPS/location-permission requirements in Phase 1.",
    "Confirm and implement Phase 1 only (no Phase 2+ scope)."
  ],
  "nonGoals": [
    "Adding GPS-based proximity search or map UI.",
    "Adding backend storage of search results or entity caches.",
    "Introducing new pages/routes or new layout panels for results.",
    "Changing normal risk scoring heuristics for non-public-location searches.",
    "Implementing non-Nominatim OSM querying methods (e.g., Overpass) in Phase 1."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}