{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 1: Frontend-only public location search (OSM Nominatim) + remove platform branding",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an isolated frontend public-location Search module that detects keywords (accent/case-insensitive) and queries OpenStreetMap Nominatim for public entities without changing existing heuristics/scoring for non-public searches.",
      "acceptanceCriteria": [
        "A new minimal, modular Search layer exists in the frontend codebase (isolated utility/hook/components as appropriate) and can be invoked from the current search/analysis flow without app restructuring.",
        "Public-location keyword detection is accent-insensitive and case-insensitive (e.g., “polícia”, “policia”, “POLICIA” match).",
        "The keyword list includes at minimum: hospital, police, fire station, bombeiros, polícia, emergência, government office.",
        "When a public-location keyword is detected, the module queries OpenStreetMap Nominatim using public categories: hospital, police, fire_station, government, emergency.",
        "No backend canister methods are added/changed; no persistence is introduced (no new backend storage; no required database-like layer).",
        "The existing scoring/heuristics for normal searches remains unchanged and continues to run for non-public-location queries."
      ],
      "file_operations": [
        {
          "path": "frontend/src/search/publicLocationSearch.ts",
          "operation": "create",
          "description": "Create an isolated public-location search utility that (1) performs accent/case-insensitive keyword detection using the existing normalizeText helper, and (2) runs a Nominatim fetch for public categories (hospital, police, fire_station, government, emergency) and returns normalized entity results for the UI (including name/category/city-region/phone when available)."
        },
        {
          "path": "frontend/src/hooks/usePublicLocationSearch.ts",
          "operation": "create",
          "description": "Create a small React hook that wraps the publicLocationSearch utility with loading/error state and a single async search function so it can be invoked from the current search/analysis flow without restructuring."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookup.tsx",
          "operation": "modify",
          "description": "Integrate the new public-location detection + Nominatim query into the existing AdvancedContactLookup flow for the appropriate input type (e.g., unknown/message-like inputs). If a public-location keyword is detected, invoke the new hook and skip the normal heuristic analysis path for that request only; otherwise, keep the current analysis logic unchanged."
        },
        {
          "path": "frontend/src/utils/antifraudTextNormalize.ts",
          "operation": "modify",
          "description": "If needed for correctness, extend/adjust normalization helpers to ensure robust accent-insensitive and case-insensitive matching for the public-location keyword list without changing any existing message-scoring behavior (keep changes strictly limited to normalization helpers)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render public-location search results in the existing results display area with the current card/typography style, including proper empty/error states.",
      "acceptanceCriteria": [
        "Public-location results are displayed in the same existing results area currently used for analysis results (no new side panels, no new page sections).",
        "Each returned entity shows: Entity name, Category, City/Region, Phone number (if available).",
        "Result rendering is consistent with the current card/typography style used by the existing results container (no theme overhaul).",
        "If Nominatim returns no results or errors, the user sees an error/empty state in the same results area (no new UI regions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublicLocationResults.tsx",
          "operation": "create",
          "description": "Add a minimal results renderer that reuses the existing results container styling patterns (Card/typography) to display a list of Nominatim entities with: Entity name, Category, City/Region, Phone (if present), plus an in-place empty/error state. Use shadcn-ui components (e.g., Card, Alert, Badge) to match existing styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookup.tsx",
          "operation": "modify",
          "description": "Render PublicLocationResults in the same location where AdvancedContactLookup currently renders its results (reuse the existing results area; do not add panels/sections). Ensure empty/error states appear in that same area. Use shadcn-ui components to keep existing style consistency. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "For Nominatim-sourced public entities only, force risk_score=0 and risk_level=LOW in the displayed results while keeping normal scoring unchanged for all other flows.",
      "acceptanceCriteria": [
        "Every public-location entity displayed includes (or is represented by) a risk score of 0 and a risk level of LOW.",
        "The override applies only to public-location search results sourced from Nominatim; it does not alter message/email/phone/crypto scoring logic for other flows.",
        "No changes are made to the existing message scoring engine logic (e.g., no edits that change scoring behavior for message analysis)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/search/publicLocationSearch.ts",
          "operation": "modify",
          "description": "Ensure the returned public-entity model includes explicit UI-ready risk fields set to riskScore=0 and riskLevel='Low' (or equivalent) for Nominatim-derived entities only, without touching the existing structured fraud analysis/scoring utilities."
        },
        {
          "path": "frontend/src/components/PublicLocationResults.tsx",
          "operation": "modify",
          "description": "Display risk for each public-location entity as LOW with a score of 0 in the same visual style conventions used by existing result cards (no redesign). Use shadcn-ui badges/typography as appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookup.tsx",
          "operation": "modify",
          "description": "Guarantee that the risk override is applied only when rendering Nominatim public-location results, and that the existing analyzeMessage/analyzeEmail/analyzePhone/analyzeCrypto paths remain unchanged for normal searches."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove platform branding/links from footer and metadata (HTML head, runtime SEO helper, manifest) and ensure Phase 1 introduced/modified user-facing strings are English.",
      "acceptanceCriteria": [
        "The footer no longer includes platform branding/link elements (e.g., remove the external platform link and related icon/text currently present).",
        "No platform references are introduced into index.html metadata, runtime SEO title/description generation, or the web manifest.",
        "All remaining user-facing strings introduced/modified by this Phase 1 implementation are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Remove the external platform link and icon/text currently present in the footer (e.g., the Internet Computer/ICP reference), keeping the rest of the footer content and layout structure intact."
        },
        {
          "path": "frontend/src/utils/seo.ts",
          "operation": "modify",
          "description": "Update runtime SEO title/description behavior to remove platform branding references from document.title and related metadata generation; keep any new/modified visible strings in English."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove platform branding references from static HTML metadata (title/description). Ensure any modified metadata text is in English."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Remove platform branding references from the PWA manifest description/metadata and ensure any modified strings are in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove/adjust any hardcoded document.title initialization that includes platform references so it aligns with updated metadata rules and does not reintroduce removed branding."
        }
      ]
    }
  ]
}