{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Targeted frontend fixes for PWA installability, strict consent gating, and institutional page layout polish",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure runtime service worker registration/activation control and make the existing install CTA reliably trigger the captured beforeinstallprompt flow when available.",
      "acceptanceCriteria": [
        "On first load in a supported browser, the app registers `public/service-worker.js` and `navigator.serviceWorker.controller` becomes non-null after activation/refresh (i.e., the service worker controls the page).",
        "When `beforeinstallprompt` is available, the existing install CTA (from `PwaInstallAction`) triggers the native install prompt via the stored deferred prompt event (no link-like fallback behavior while install is actually available).",
        "PWA behavior remains compatible with the existing manifest at `frontend/public/manifest.webmanifest` and the existing service worker routes/caching logic in `frontend/public/service-worker.js` (no breaking changes to offline navigation fallback)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/pwaRuntime.ts",
          "operation": "create",
          "description": "Add a small PWA runtime singleton to (1) register the service worker at runtime and track when it becomes controlling, and (2) capture/store the `beforeinstallprompt` event as early as possible for later prompting. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePwaInstall.ts",
          "operation": "modify",
          "description": "Update the hook to read/install from the shared PWA runtime stored deferred prompt (rather than relying solely on a component-mounted listener), so `isInstallable` and `promptInstall()` stay accurate even if `beforeinstallprompt` fires before `HomePage` fully mounts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Initialize the PWA runtime during app startup (without touching `frontend/src/main.tsx`) so service worker registration happens on first render, clients are claimed, and the global `beforeinstallprompt` capture is active regardless of current route. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PwaInstallAction.tsx",
          "operation": "modify",
          "description": "Ensure the install CTA always calls the prompt function when installability is available (and does not open the instructions dialog in that case), aligning UI behavior with the stored deferred prompt flow. This uses shadcn-ui Button/Dialog patterns—verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the consent gate modal strictly non-dismissible until all required consents are accepted, while persisting acceptance using the existing localStorage consent state.",
      "acceptanceCriteria": [
        "While consent is required, the modal cannot be closed by pressing ESC, clicking outside the dialog, or any overlay interaction; only the explicit accept action (enabled after all checkboxes are checked) can remove the gate.",
        "After acceptance, consent is persisted using the existing storage key/versioning in `frontend/src/hooks/useConsentGate.ts`, and the modal does not reappear on refresh unless the consent version is bumped.",
        "The app remains blocked from use while consent is required (no interaction with core app UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ConsentGateModal.tsx",
          "operation": "modify",
          "description": "Harden the modal against all dismiss interactions by preventing outside-click/overlay dismissal and any implicit close events in addition to the existing ESC prevention; keep acceptance only via the explicit accept action after all checkboxes are checked. This uses the shadcn-ui AlertDialog—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Tighten the interaction-blocking wrapper while consent is required to ensure the core app UI remains non-interactive (including navigation interactions) until acceptance, while keeping /terms and /privacy viewable as currently guarded. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply targeted layout/styling adjustments to improve spacing rhythm, hierarchy, and readability across Home and institutional pages without changing existing content.",
      "acceptanceCriteria": [
        "Institutional pages using `InstitutionalPageLayout` have consistent section spacing and mobile-friendly typography (no cramped separators or uneven vertical rhythm).",
        "The Home page layout remains centered and readable across mobile and desktop with consistent container spacing relative to the sticky header and footer.",
        "No changes are made to antifraud analysis logic or the textual content itself; changes are limited to layout/styling/composition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstitutionalPageLayout.tsx",
          "operation": "modify",
          "description": "Refine the institutional layout wrapper spacing (container padding, vertical rhythm, and content stack spacing) to make Mission/How It Works/Terms/Privacy consistent across breakpoints without altering the rendered text. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the existing institutional typography rules to improve readability and spacing consistency (e.g., reduce cramped stacked elements and avoid constraining full-width layout containers while keeping comfortable line lengths for text). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Polish the Home page layout spacing (hero spacing, section rhythm, and responsive container padding) to better align with the sticky header/footer while keeping the existing content and antifraud analysis behavior unchanged. This page uses shadcn-ui Card/Tabs components—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TermsPage.tsx",
          "operation": "modify",
          "description": "Reduce visual clutter and improve vertical rhythm by tuning separator spacing and section composition (layout-only), without changing any Terms content. Uses shadcn-ui Card/Separator—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PrivacyPage.tsx",
          "operation": "modify",
          "description": "Reduce visual clutter and improve vertical rhythm by tuning separator spacing and section composition (layout-only), without changing any Privacy content. Uses shadcn-ui Card/Separator—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MissionPage.tsx",
          "operation": "modify",
          "description": "Apply small layout-only class adjustments (e.g., card spacing and typography consistency) to align with the updated `InstitutionalPageLayout`, without editing any textual content. Uses shadcn-ui Card—verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HowItWorksPage.tsx",
          "operation": "modify",
          "description": "Apply small layout-only class adjustments (e.g., accordion/card spacing and typography consistency) to align with the updated `InstitutionalPageLayout`, without editing any textual content. Uses shadcn-ui Accordion/Card—verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}