{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refine Message Analysis critical-trigger scoring thresholds (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refine message text risk scoring so critical trigger phrase detection overrides incremental heuristics with minimum thresholds (85/92/100) without impacting phone/email/crypto flows.",
      "acceptanceCriteria": [
        "When analyzing a message containing 1 critical trigger phrase, the returned riskScore is >= 85 regardless of the underlying heuristic score.",
        "When analyzing a message containing exactly 2 critical trigger phrases, the returned riskScore is >= 92 regardless of the underlying heuristic score.",
        "When analyzing a message containing 3+ critical trigger phrases, the returned riskScore is exactly 100.",
        "The override applies only to message text analysis (e.g., the function exported as analyzeMessage in frontend utilities) and does not change scoring for phone, email, or crypto analysis.",
        "No data is persisted as part of this scoring change (no backend calls or storage of message content beyond in-memory processing for the current analysis)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/structuredFraudAnalysis.ts",
          "operation": "modify",
          "description": "Update the exported message-text analysis flow to (1) detect and count matched critical trigger phrases in the message text using existing normalization utilities, and (2) apply a hard override/minimum riskScore based on critical trigger count: 1→min 85, 2→min 92, 3+→set 100, ensuring this override happens after normal heuristic scoring and is applied ONLY in analyzeMessage (message text) and not in analyzeEmail/analyzePhone/analyzeCrypto. Keep all processing in-memory and do not add any persistence or backend calls."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add the full user-provided critical words/phrases list to Message Analysis critical trigger detection with case-insensitive and accent-insensitive matching.",
      "acceptanceCriteria": [
        "All listed critical triggers are included in the frontend Message Analysis critical trigger detection list (no omissions).",
        "Matching detects triggers regardless of letter casing and diacritics (e.g., 'ola pai' matches 'Olá Pai').",
        "Trigger counting used for thresholding is based on detected trigger phrases in the message text and drives the 85/92/100 minimum thresholds.",
        "This integration is confined to message text analysis utilities and does not modify layout, routing, or other feature modules."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/messageCriticalTriggers.ts",
          "operation": "create",
          "description": "Create a dedicated constant list for message text critical trigger words/phrases containing ALL user-provided triggers exactly as provided, intended for case-insensitive and accent-insensitive matching via existing normalization utilities. This file must be used only by message text analysis."
        },
        {
          "path": "frontend/src/utils/structuredFraudAnalysis.ts",
          "operation": "modify",
          "description": "Integrate the new critical trigger list into message text critical detection by importing it and using normalization-based matching (case-insensitive, accent-insensitive). Ensure trigger counting is based on detected trigger phrases in the message text (unique phrase matches) and feeds the REQ-1 85/92/100 threshold override. Keep changes confined to message text analysis utilities."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the Search (Phone) public-number override logic remains unchanged by this patch; add a verification step without modifying phone search modules.",
      "acceptanceCriteria": [
        "No changes are made to Search (Phone) module behavior or code paths as part of this patch.",
        "Phone lookups that previously used a public-number override continue to bypass heuristics and remain unaffected by message-scoring changes.",
        "Message analysis scoring changes do not alter any phone/email/crypto lookup results."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_BUILD_VERIFICATION.md",
          "operation": "modify",
          "description": "Add a regression verification checklist item explicitly confirming that Search (Phone) public-number override logic still executes before any heuristics and that no phone module behavior changed as part of the message-analysis scoring patch (documentation-only change; do not modify any phone/search module code)."
        }
      ]
    }
  ]
}