{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Advanced Contact Lookup: Anonymous Reporting Integration, Offline PWA Cache Hardening, and i18n Coverage",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Add an in-context anonymous “Report suspicious contact” action to Advanced Contact Lookup results that opens the existing report dialog prefilled with the searched contact (phone/email) and includes an anonymity/legal notice.",
      "acceptanceCriteria": [
        "When a user completes an Advanced Contact Lookup search, the results area provides a clear “Report suspicious contact” action.",
        "Clicking the action opens a dialog that is prefilled with the searched contact value and the correct report type (phone or email).",
        "The reporting flow does not require the user to authenticate and does not display or request any personally identifying information beyond the reported contact itself.",
        "The dialog includes a short, user-facing anonymity/legal notice (English text in the EN locale; localized equivalents in other supported languages) stating that reports are anonymous and should only include public/non-sensitive information.",
        "Submitting the report shows a clear success state and closes/reset the dialog after success (consistent with existing dialog behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancedContactLookup.tsx",
          "operation": "modify",
          "description": "Track the last successful Advanced Contact Lookup normalized contact value + detected type (phone/email) and pass it to the results panel so the reporting action can prefill the report dialog without re-asking for input. Keep antifraud analysis fully frontend-only as currently implemented."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookupResultCard.tsx",
          "operation": "modify",
          "description": "Add a clearly visible “Report suspicious contact” action within the results UI and wire it to open the existing ReportSubmissionDialog in a lookup-specific mode. Use shadcn-ui Button (and optionally DialogTrigger patterns if needed) to match existing UI style; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ReportSubmissionDialog.tsx",
          "operation": "modify",
          "description": "Extend the existing report submission dialog flow to support a lookup-prefilled mode (prefilled value + forced report type phone/email, plus a short anonymity/legal notice section rendered via i18n). Ensure this mode does not request additional user-identifying fields beyond the reported contact. Use existing shadcn-ui Dialog/Select/Input/Textarea primitives already used by the component; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSubmitLookupReport.ts",
          "operation": "create",
          "description": "Create a small frontend hook/helper to submit an anonymous report from the lookup flow using the app’s existing report submission mechanism (same canister/actor flow already used elsewhere), without introducing any authentication requirement. Keep the public flow anonymous/guest-safe."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Limit Advanced Contact Lookup reporting tag choices to Spam/Phishing/Scam/Other with safe defaults while keeping compatibility with existing report category types.",
      "acceptanceCriteria": [
        "In the Advanced Contact Lookup reporting dialog, the selectable tag/category list shown to the user is limited to: Spam, Phishing, Scam, Other.",
        "The selected tag is submitted using the existing report category model (mapping to existing categories where applicable).",
        "If the user does not select a tag, the submission still works by defaulting to “Other” (or an equivalent safe default), without blocking submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReportSubmissionDialog.tsx",
          "operation": "modify",
          "description": "Add lookup-specific configuration to restrict category UI options to exactly Spam/Phishing/Scam/Other while preserving the underlying mapping to the existing ReportCategory union. In lookup mode, allow category to be omitted and default it to Other at submit time (no validation block). Use the existing shadcn-ui Select UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookupResultCard.tsx",
          "operation": "modify",
          "description": "When invoking ReportSubmissionDialog from Advanced Contact Lookup, pass the lookup-mode configuration so only the four requested tag options are shown and the safe default behavior is enabled."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Harden offline behavior for Advanced Contact Lookup using existing local cache and service worker caching (including precaching the public dataset) without impacting PWA installability.",
      "acceptanceCriteria": [
        "When offline, previously searched contacts that exist in the local cache can still be displayed in the Advanced Contact Lookup results UI.",
        "The service worker precache includes the public lookup dataset (`/data/public-contact-lookup.json`) and continues to use a network-first strategy with cache fallback for same-origin requests, without introducing install prompt regressions.",
        "No new service worker console errors are introduced in production mode.",
        "PWA install CTA remains functional after these changes."
      ],
      "file_operations": [
        {
          "path": "frontend/public/service-worker.js",
          "operation": "modify",
          "description": "Keep `/data/public-contact-lookup.json` in the precache list and refine the network-first-with-cache-fallback fetch handling to be explicitly safe for same-origin GET requests (avoid caching non-GET or cross-origin requests) to reduce production console errors and preserve PWA installability."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookup.tsx",
          "operation": "modify",
          "description": "Verify and (if needed) adjust the offline path so cached results are surfaced consistently when offline (best-effort), relying on the existing localStorage-backed cache hook and without changing the PWA install flow."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Add/verify i18n coverage for all user-facing text introduced/changed by reporting-from-lookup across PT/EN/ES/FR/ZH/AR/RU, ensuring EN strings are in English.",
      "acceptanceCriteria": [
        "All new labels/buttons/help text related to reporting-from-lookup render via the existing i18n system (no hardcoded strings in components).",
        "EN locale strings are written in English.",
        "No missing-key placeholders (undefined/fallback fragments) appear in any supported language for the reporting-from-lookup flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add translation keys for: the lookup report CTA label, the anonymity/legal notice text, and any lookup-mode dialog labels/help text (including any adjusted field labels/placeholders). Ensure all supported locales (PT/EN/ES/FR/ZH/AR/RU) define these keys and EN values are English."
        },
        {
          "path": "frontend/src/components/AdvancedContactLookupResultCard.tsx",
          "operation": "modify",
          "description": "Replace any new user-facing strings for the lookup report action with i18n keys from the existing I18nProvider (no hardcoded labels)."
        },
        {
          "path": "frontend/src/components/ReportSubmissionDialog.tsx",
          "operation": "modify",
          "description": "Render the anonymity/legal notice and any lookup-mode-specific labels via i18n keys (no hardcoded strings) while preserving existing dialog behavior and styling. Use existing shadcn-ui Dialog and form primitives; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Update production verification checklist with explicit steps for Advanced Contact Lookup (phone/email), offline cached behavior, and anonymous report submission from lookup with tag selection.",
      "acceptanceCriteria": [
        "`frontend/PRODUCTION_BUILD_VERIFICATION.md` includes a new checklist subsection covering: (1) Advanced Contact Lookup search behavior, (2) offline cached lookup behavior, and (3) submitting a report from lookup results with tags Spam/Phishing/Scam/Other.",
        "Checklist steps are concrete and repeatable (what to click/type, expected UI states)."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_BUILD_VERIFICATION.md",
          "operation": "modify",
          "description": "Add a new checklist subsection describing repeatable test steps for: (1) Advanced Contact Lookup searches for both phone and email, (2) offline behavior using previously cached lookup results, and (3) opening the report dialog from lookup results, selecting each allowed tag (Spam/Phishing/Scam/Other), and verifying success/close behavior."
        }
      ]
    }
  ]
}