{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Step 4: Frontend-only deterministic antifraud engine with localized critical-keyword High-risk overrides",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Complete the frontend-only deterministic antifraud engine for Message/Email/Phone/Crypto tabs, returning a consistent StructuredAnalysisResult without any backend/canister calls.",
      "acceptanceCriteria": [
        "On the Home page, running analyses for Message/Email/Phone/Crypto uses only frontend utility functions and does not perform any backend actor calls.",
        "Each analysis returns a consistent StructuredAnalysisResult with risk in {'Low','Medium','High'} and non-empty explanation/recommendation strings.",
        "The UI continues to render results via the existing StructuredAnalysisResultCard component with no regressions to navigation, consent gating, PWA install flow, or institutional pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/structuredFraudAnalysis.ts",
          "operation": "modify",
          "description": "Refactor/complete analyzeMessage/analyzeEmail/analyzePhone/analyzeCrypto to be fully deterministic and frontend-only, ensure all code paths return { risk: 'Low'|'Medium'|'High', explanation: non-empty, recommendation: non-empty }, and remove/avoid any accidental backend/canister integrations (keep this module pure utility logic)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Audit HomePage handlers to ensure they only call local analyze* utilities and never call backend actors for message/email/phone/crypto analysis; keep existing rendering via StructuredAnalysisResultCard and do not alter consent gating or PWA install behavior."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add mandatory High-risk override for critical scam keywords in message analysis for PT/EN/ES/FR/ZH/AR/RU with case-insensitive and accent-insensitive matching, with localized explanation noting the override trigger.",
      "acceptanceCriteria": [
        "For each supported language, there is a defined set of critical keywords used for mandatory High-risk detection (not only Portuguese).",
        "If a message contains any critical keyword (including accented/unaccented variants where relevant), analyzeMessage returns risk === 'High' even if no other indicators are present.",
        "The returned explanation/recommendation are localized to the selected UI language, and the explanation mentions that the High risk was triggered by critical keywords (localized wording)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/structuredFraudAnalysis.ts",
          "operation": "modify",
          "description": "Implement a language-keyed critical keyword dictionary for PT/EN/ES/FR/ZH/AR/RU; apply a mandatory High-risk override in analyzeMessage using case-insensitive + accent-insensitive normalization, and return a localized explanation/recommendation that explicitly states the High risk was triggered by critical keywords (with consistent fallback to English when language is unsupported)."
        },
        {
          "path": "frontend/src/utils/antifraudTextNormalize.ts",
          "operation": "create",
          "description": "Add a small shared text normalization helper (lowercasing + unicode diacritic stripping) for accent-insensitive matching used by the message critical-keyword override and other heuristics."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Localize all antifraud engine outputs (including embedded indicator labels) for PT/EN/ES/FR/ZH/AR/RU with a consistent English fallback for unsupported language codes.",
      "acceptanceCriteria": [
        "Switching the language selector changes the language of explanation and recommendation strings returned by all analyze* functions.",
        "Indicator phrases embedded inside explanations are localized (no Portuguese-only indicator strings when language is not PT).",
        "If an unsupported language code is encountered, outputs fall back to English consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/structuredFraudAnalysis.ts",
          "operation": "modify",
          "description": "Introduce a centralized per-language indicator-label map (e.g., urgency language, credential requests, links detected, financial requests, crypto addresses, suspicious domain extension, etc.) and ensure analyzeMessage/analyzeEmail/analyzePhone/analyzeCrypto build indicator lists using these localized labels so explanations read naturally in PT/EN/ES/FR/ZH/AR/RU and never mix languages; ensure getTemplates/getIndicatorLabels apply an English fallback for unknown language codes."
        },
        {
          "path": "frontend/src/components/StructuredAnalysisResultCard.tsx",
          "operation": "modify",
          "description": "Verify the result card continues to display the structured antifraud outputs as-provided (localized explanation/recommendation), without introducing any new translations inside the card that could cause mixed-language output; keep existing UI behavior intact."
        }
      ]
    }
  ]
}