{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production PWA consolidation, finalized install flow, complete i18n, and verification checklist",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Replace temporary PWA manifest and service worker with final production versions while preserving AntiFraud branding and generated icon asset paths.",
      "acceptanceCriteria": [
        "`frontend/public/manifest.webmanifest` is updated for production (no test-only description such as \"Teste PWA WebAPK AntiFraud\"), keeps `name`/`short_name` as AntiFraud, keeps the existing generated icon paths, and includes `id` plus `prefer_related_applications: false`.",
        "`frontend/public/service-worker.js` is updated for production (not the temporary `antifraud-test` cache), uses the consolidated production caching strategy required for stable installability (WebAPK where supported), and does not break normal navigation/routing.",
        "A production build served over HTTPS loads with the manifest detected by the browser and the service worker controlling the page (no registration errors in console in production mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update manifest metadata for production: remove test-only description, keep `name`/`short_name` as AntiFraud, keep `id`, keep `prefer_related_applications: false`, and preserve existing icon paths `/assets/generated/antifraud-pwa-icon.dim_192x192.png` and `/assets/generated/antifraud-pwa-icon.dim_512x512.png`."
        },
        {
          "path": "frontend/public/service-worker.js",
          "operation": "modify",
          "description": "Replace the temporary test cache configuration with a production cache name/version and a consolidated production caching strategy that maintains stable installability and supports SPA navigation (ensure navigation requests are not broken and can fall back to the app shell when appropriate), while preserving caching of `/manifest.webmanifest` and the generated icons `/assets/generated/antifraud-pwa-icon.dim_192x192.png` and `/assets/generated/antifraud-pwa-icon.dim_512x512.png`."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Finalize PWA install prompt capture with production setup/trigger utilities that manage deferred prompt lifecycle and return accepted status.",
      "acceptanceCriteria": [
        "`frontend/src/pwa/install.ts` no longer contains temporary debug/test-only behavior (e.g., `window.PWA_CAN_INSTALL` flags and console-only instrumentation intended for testing).",
        "Calling `setupPWAInstall()` once on app startup results in `beforeinstallprompt` being captured (via a module-level deferred prompt) when the app becomes installable.",
        "Clicking the install CTA triggers `deferredPrompt.prompt()` when available, and `triggerPWAInstall()` resolves to `true` only when the user accepts the prompt; the deferred prompt is cleared after `userChoice` and also on the `appinstalled` event."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/install.ts",
          "operation": "modify",
          "description": "Implement the production `setupPWAInstall()` / `triggerPWAInstall()` flow: capture and store `beforeinstallprompt` in a module-level deferred prompt, clear prompt state on `appinstalled`, remove test-only globals/logging, prevent duplicate listener registration when `setupPWAInstall()` is called multiple times, and ensure `triggerPWAInstall()` returns a boolean indicating whether the user accepted installation and clears the deferred prompt after `userChoice`."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Localize all user-facing install CTA strings (button label and ineligible fallback message) via i18n for all supported languages.",
      "acceptanceCriteria": [
        "`frontend/src/components/InstallButton.tsx` does not contain hardcoded Portuguese strings for the button label or alert message.",
        "The install button label uses the existing i18n key (`installPrimaryButton`) and renders correctly for PT/EN/ES/FR/ZH/AR/RU.",
        "If installation is not eligible, the fallback message is localized via a dedicated i18n key added for this purpose (English text present in the EN locale)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallButton.tsx",
          "operation": "modify",
          "description": "Replace hardcoded Portuguese strings with i18n-driven text using `useI18n()`: button label should use `t.installPrimaryButton`, and the non-eligible fallback alert should use a new dedicated i18n key (e.g., `installNotEligibleMessage`) instead of a hardcoded string."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add a dedicated localized string key for the install ineligible fallback message (ensure English text is present in the EN locale and include equivalents for ES/FR/ZH/AR/RU), and ensure PT remains the source of truth for the Portuguese string."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add complete EN/ES/FR/ZH/AR/RU translations derived from Portuguese, ensuring no missing UI keys and full localized institutional content.",
      "acceptanceCriteria": [
        "`frontend/src/i18n/translations.ts` includes complete locale objects for `en`, `es`, `fr`, `zh`, `ar`, and `ru` (in addition to `pt`) with no missing keys used by the UI.",
        "Switching languages via the existing language selector updates all visible UI strings (navigation, home page, consent modal, install CTA, analysis results, transparency labels) without falling back to Portuguese or showing undefined/missing text.",
        "Institutional pages (`/mission`, `/how-it-works`, `/terms`, `/privacy`) render complete localized content for each supported language (not placeholders or truncated summaries)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Populate full translation objects for `en`, `es`, `fr`, `zh`, `ar`, and `ru`, mirroring all keys used by the UI from the official Portuguese source, including: navigation, consent modal, PWA install UI (including the new fallback key), analysis results and transparency labels, and complete institutional page content keys/paragraph arrays for Mission/How It Works/Terms/Privacy."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Create a repeatable, developer-facing production verification checklist/report for the final build.",
      "acceptanceCriteria": [
        "A new markdown file (e.g., `frontend/PRODUCTION_BUILD_VERIFICATION.md`) exists and is written in English.",
        "The checklist includes explicit, step-by-step validation items for: SPA navigation/routes (including aliases and 404 fallback behavior), consent gate blocking behavior until accepted, global AntiFraud / by HCoragem branding presence, antifraud analysis for message/email/phone/crypto with transparency sections, multilingual smoke checks for PT/EN/ES/FR/ZH/AR/RU, and PWA install behavior (including a reference/link to the existing `frontend/PWA_WEBAPK_ANDROID_TEST.md` for the Android WebAPK validation flow).",
        "The document ends with a clear pass/fail sign-off section indicating whether the build is ready for live deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_BUILD_VERIFICATION.md",
          "operation": "create",
          "description": "Add an English production verification checklist/report covering: route navigation (including `/institucional` alias behavior and unknown-route handling), 404 fallback behavior, consent gate blocking until accepted, AntiFraud/by HCoragem branding checks, antifraud analysis flows (message/email/phone/crypto) including transparency sections, public contact lookup behavior, full multilingual smoke checks for PT/EN/ES/FR/ZH/AR/RU, and PWA installation validation (include a reference to `frontend/PWA_WEBAPK_ANDROID_TEST.md` for Android WebAPK flow). End with a clear pass/fail sign-off section."
        }
      ]
    }
  ]
}