{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add ES/FR/DE i18n with PT fallback, expand language dropdown, and update responsive footer references",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Extend i18n to support pt/en/es/fr/de with a guaranteed Portuguese fallback for missing translation keys.",
      "acceptanceCriteria": [
        "The app recognizes five language codes: pt, en, es, fr, de.",
        "If a translation key is missing in the active language, the Portuguese value is shown instead of rendering undefined/blank.",
        "Switching languages does not change routing, app layout structure, or build configuration.",
        "No backend/canister changes are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add ES/FR/DE language entries and ensure the exported Language type includes exactly: pt, en, es, fr, de. Add placeholder dictionaries for es/fr/de (partial is acceptable) while keeping Portuguese as the canonical full key set so it can act as the fallback baseline."
        },
        {
          "path": "frontend/src/i18n/I18nProvider.tsx",
          "operation": "modify",
          "description": "Implement safe translation fallback behavior by composing the active language translations over the Portuguese baseline (e.g., merge pt + active) so any missing key in en/es/fr/de resolves to Portuguese. Also harden initial language selection so an unknown stored value safely falls back to 'pt' without runtime errors."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the language dropdown to always show PT/EN/ES/FR/DE with native names and switch UI language on selection.",
      "acceptanceCriteria": [
        "The language selector dropdown displays five options: PT, EN, ES, FR, DE.",
        "The currently selected language is reflected in the dropdown trigger (desktop shows native name; mobile shows the 2-letter code).",
        "Selecting ES/FR/DE works without runtime errors even if translations are placeholders."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSelector.tsx",
          "operation": "modify",
          "description": "Expand the languages list to exactly five options (pt/en/es/fr/de) with appropriate native names (e.g., Português, English, Español, Français, Deutsch) and ensure selection calls setLanguage with the correct code. Use the existing shadcn-ui DropdownMenu/Button components to keep behavior consistent; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a professional footer references line linking to ENISA, CISA, CNCS, and Europol while preserving existing credits and ICP section.",
      "acceptanceCriteria": [
        "Footer still shows the existing 'by HCoragem' credit.",
        "Footer still contains the existing Internet Computer/ICP reference section already present in the UI.",
        "Footer includes the exact text line (localized or in English if not localized yet): 'References public cybersecurity advisories from:' followed by ENISA (EU), CISA (USA), CNCS (PT), Europol (EU) as clickable links to: https://www.enisa.europa.eu/, https://www.cisa.gov/, https://www.cncs.gov.pt/, https://www.europol.europa.eu/.",
        "No certification/audit badges or official certification seals are added (text links only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add a new translation key for the footer references prefix text (managed via translations per constraints), e.g., 'References public cybersecurity advisories from:' (English is acceptable). Ensure the key exists in pt and can be optionally overridden in en/es/fr/de."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a new footer line that renders: 'References public cybersecurity advisories from:' followed by text-only links to ENISA, CISA, CNCS, and Europol using the exact URLs provided. Preserve existing 'by HCoragem' and the ICP credit section, and do not add any badge/seal imagery (links only)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure language selector and footer remain fully responsive and any icons/images used are served from frontend public /assets.",
      "acceptanceCriteria": [
        "On small screens, the footer content wraps/aligns without overflow or overlapping elements.",
        "On desktop screens, footer content remains readable and properly spaced.",
        "Any images/icons referenced by these components resolve under /assets/ (including existing /assets subfolders) and render crisply at 16x16px when used as small icons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Adjust footer layout classes to support wrapping and readable spacing across breakpoints (especially when the new references line is added), preventing overflow/overlap on mobile while keeping a clear horizontal layout on desktop. Keep existing icon image sources under /assets (e.g., /assets/generated/icp-logo-icon.dim_16x16.png, /assets/generated/haveibeenpwned-icon.dim_16x16.png, /assets/generated/phishtank-icon.dim_16x16.png)."
        },
        {
          "path": "frontend/src/components/LanguageSelector.tsx",
          "operation": "modify",
          "description": "Validate responsive trigger behavior remains correct with five options (desktop shows native name; mobile shows code) and that no non-/assets images are introduced. Continue using the existing shadcn-ui dropdown primitives; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}