{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Phase 1: Extend (or create minimal) Search module to detect public-location keywords and query OpenStreetMap Nominatim for public entities, rendering results in existing results container with scoring overridden (risk_score=0, risk_level=LOW) for those entities only, with no backend restructuring, no UI/layout changes, and no scoring engine modifications.",
  "architectural_notes": [
    "Implement as minimal, modular, isolated Search module if none exists; avoid app-wide rebuild/restructure.",
    "Frontend-only integration using OpenStreetMap Nominatim API; no backend restructuring, no persistent storage.",
    "Reuse existing results display container; no new panels or layout/UI redesign.",
    "For public-location results only: force risk_score=0 and risk_level=LOW; override heuristics completely without changing normal search scoring logic.",
    "Remove/avoid any platform references in footer or metadata."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-implement-a-minimal-isolated-frontend-search-module-that-detects-public-location-keywords-and-runs-openstreetmap-nominatim-queries-for-public-entities-without-changing-backend-behavior-without-restructuring-the-app-and-without-modifying-the-existing-message-scoring-engine",
      "title": "Implement a minimal, isolated frontend Search module that detects public-location keywords and runs OpenStreetMap Nominatim queries for public entities, without changing backend behavior, without restructuring the app, and without modifying the existing message scoring engine.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-render-public-location-search-results-inside-the-existing-results-display-area-reuse-the-current-results-container-matching-the-existing-result-format-style-and-without-introducing-new-layout-panels-or-visual-redesign",
      "title": "Render public-location search results inside the existing results display area (reuse the current results container), matching the existing result format style and without introducing new layout panels or visual redesign.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-for-all-returned-public-entities-from-nominatim-public-location-searches-override-risk-output-to-risk-score-0-and-risk-level-low-fully-overriding-heuristics-for-those-entities-only-while-keeping-normal-scoring-unchanged-for-normal-searches",
      "title": "For all returned public entities from Nominatim public-location searches, override risk output to risk_score = 0 and risk_level = LOW, fully overriding heuristics for those entities only, while keeping normal scoring unchanged for normal searches.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-platform-references-from-the-application-footer-and-metadata-html-head-seo-helpers-manifest-so-no-platform-branding-or-links-appear-in-the-footer-or-metadata",
      "title": "Remove platform references from the application footer and metadata (HTML head/SEO helpers/manifest) so no platform branding or links appear in the footer or metadata.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Phase 1 Public Location Search Extension: detect public-location keywords, query OSM Nominatim categories (hospital/police/fire_station/government/emergency), display entity details in existing results area, and override scoring (risk_score=0, risk_level=LOW) for returned public entities only.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Phase 1: Public Location Search via OpenStreetMap Nominatim (frontend-only, no layout/scoring changes)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}